{
  "menu": {
    "title": null,
    "text": "Main Menu",
    "image_path": "Final-Project_1/Background Image/image1.png",
    "buttons": [
      {"rect": ["center", "auto", 300, 50], "text": "Continue", "action": "continue"},
      {"rect": ["center", "auto", 300, 50], "text": "New Game", "action": "new_game"},
      {"rect": ["center", "auto", 300, 50], "text": "Exit", "action": "exit"}
    ],
    "music": "Final-Project_1/Sounds/Musics/AoE2_Main_theme.mp3"
  },
  "scene1": {
    "title": "Введение",
    "text": "Сегодня вы станете бессмертным путешественником во времени, теперь вы отправитесь в Санкт-Петербург, но самый главный вопрос не где, а когда.\nВ поисках правды, подлинной истории этого города.\nИспытайте на себе, насколько ваши решения влияют на историю и насколько они отличаются от реальности.",
    "image_path": "Final-Project_1/Images/1.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Continue", "tooltip_text": "Continue", "action": "scene2"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene2": {
    "title": "До основания Санкт-Петербурга",
    "text": "Добро пожаловать в 1700 год, когда в Англии разгоралась Северная война (1700-1721). \nЭтот конфликт, инициированный Петром I и коалицией (Саксония-Польша, Дания-Норвегия), был направлен главным образом на то, чтобы сломить шведское господство на Балтийском море и вернуть России выход к этому морю.",
    "image_path": "Final-Project_1/Images/2.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Выступите в роли наблюдателя и проследите за ходом войны между Российской империей и шведами за господство на Балтийском море.", "action": "scene3"},
      {"rect": [600, 580, 300, 100], "text": "Вступайте в армию, чтобы ускорить процесс завоевания новой территории, необходимой для развития Российской империи.", "action": "scene26"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene3": {
    "title": "Окно в Европу",
    "text": "Дата: 16 мая (27 мая по григорианскому календарю) 1703 года.FМесто: Заячий остров (Заячий), дельта реки Невы, Балтийское море.Ситуация: Петр I только что захватил шведскую крепость Ниенсканс. Он отчаянно нуждается в балтийском порте и «окне в Европу». Место это болотистое, нездоровое, отдаленное и с жестоким климатом. Советники предупреждают его о трудностях. ",
    "image_path": "Final-Project_1/Images/3.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Замаскироваться под голландского купца и повлиять на Петра, чтобы тот построил островную крепость для защиты входа в Неву. А также построить на острове корабли для защиты Балтики", "action": "scene4"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene4": {
    "title": "Начало города",
    "text": "Для помощи в строительстве было перевезено множество слуг, многие умерли от голода и холода. Хотя в последующие годы Петр тяжело заболел, здания стали эмблемой города, а крепость была завершена в 1706 году.",
    "image_path": "Final-Project_1/Images/4.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Наблюдение за ходом войны со шведами", "action": "scene5"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene5": {
    "title": "Шведское наступление",
    "text": "Карл XII Шведский, победив Августа II Польского, вступает в Россию с 35 000 войск. Посмотрите, как русские применяют «выжженную землю», из-за чего Карл XII направляет свою армию в Украину в поисках союзников и снабжения. Из-за зимы многие шведские солдаты замерзают насмерть, а в битве при Лесной 9 октября 1708 года Карл теряет свой обоз с припасами. Карл XII ранен в ногу во время экзамена",
    "image_path": "Final-Project_1/Images/5.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Вы оказываетесь в роли помощника хирурга в русском лагере, чтобы стать свидетелем одного из самых решающих моментов Северной войны - Полтавской битвы.", "action": "scene6"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene6": {
    "title": " Полтавская битва 8 июля 1709 года",
    "text": "Здесь вы увидите, как Петр I подготовил целую тактическую систему, оснащенную 102 пушками. Тем временем Карл XII (на носилках из-за ранения в ногу) приказал атаковать, но шведы прорвали линию фронта, что привело их в ловушку, и продвинулись на открытую равнину перед русским лагерем, где русские с помощью пушек уничтожили его армию. Карла XII эвакуируют его драбанты (королевская гвардия).",
    "image_path": "Final-Project_1/Images/6.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Вы материализуетесь на набережной Невы, Петр I только что издал Указ № 2021, официально переносящий столицу из Москвы в Санкт-Петербург.", "action": "scene7"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene7": {
    "title": "Перенос столицы",
    "text": "Петр издает указ: «Всем знатным семьям до 1715 года построить здесь свои дома», поскольку никто не хочет переезжать в болотистую местность с ужасным климатом. В результате строятся дворцы в стиле барокко, такие как Миншиков, до сих пор стоящий на Васильевском острове. Из Амстердама ежегодно прибывает 300 торговых судов (в 1703 году их было всего 20). На острове Котлин, в будущем Кронштадте, строится первая императорская таможня. Православная церковь отказывается перевести митрополита в другое место, мотивируя это тем, что «Петербург - город без святых». В ответ Петр в 1713 году в качестве символического жеста основывает Александро-Невский монастырь.",
    "image_path": "Final-Project_1/Images/7.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Проникнув в дом в качестве врача, вы становитесь свидетелем смерти Петра I в опочивальне Зимнего дворца. Перед смертью он попросил листок бумаги, но успел написать только «Оставить все...» (это должно было обозначить преемника), но завершить свое желание не смог.", "action": "scene8"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene8": {
    "title": "Екатерина I",
    "text": "Екатерина I была провозглашена императрицей Преображенской гвардией во главе с Меньшиковым. Она основала Петербургскую академию наук (1725), а город постепенно украшался. Несмотря на это, консервативно настроенные дворяне хотели вернуть столицу в Москву.",
    "image_path": "Final-Project_1/Images/8.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Дождавшись 1762 года, вы появляетесь в садах Зимнего дворца, переодетый офицером Измайловской гвардии. Это рассвет переворота, который изменит судьбу России. Переворот против Петра III (внука Петра Великого)", "action": "scene9"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene9": {
    "title": "Catalina II",
    "text": "Екатерина II предстала перед Измайловским и Преображенским полками, одетая в военную форму, и обратилась к войскам с речью, чтобы заручиться их поддержкой. Тем временем ее мужа, Петра III, застали пьяным в его дворце в Ораниенбауме и под угрозой отречения вынудили отречься от престола. Через несколько дней, 17 июля 1762 года, он был убит Алексеем Орловым, что закрепило восхождение Екатерины на престол. Придя к власти, Екатерина Великая предприняла масштабные преобразования в России, особенно в Санкт-Петербурге, где заменила деревянные постройки величественными каменными зданиями. Она заказала строительство Зимнего дворца (автор Растрелли), основала Эрмитаж (1764) как свою частную коллекцию и учредила Смольный институт, ставший пионером в области образования для дворянок. Кроме того, в честь наследия своего предшественника он воздвиг культовый памятник Петру I, известный как Медный всадник (1782), символ прогресса и величия Российской империи.",
    "image_path": "Final-Project_1/Images/9.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "В личных покоях Зимнего дворца, переодетый личным врачом Екатерины II. Вы наблюдаете за тем, как 67-летняя императрица мучается после инсульта.", "action": "scene10"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene10": {
    "title": "Смерть Екатерины II ",
    "text": "Екатерина II безжизненно лежала в своей постели, ее мощный голос замолчал навсегда. В 1792 году она тайно написала политическое завещание, содержащее взрывоопасные распоряжения: Она лишила наследства своего сына Павла, которого считала «негодным к управлению», и назначила наследником своего внука Александра, будучи уверенной, что он будет «править в соответствии с идеалами Просвещения». Павел I, обнаружив документ, поднял его перед свидетелями с дрожащими от ярости руками, и пламя сожгло последние слова его матери вместе с ее видением современной России.Правление Павла I в России (1796-1801) было коротким, бурным и авторитарным периодом.",
    "image_path": "Final-Project_1/Images/10.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Вы направляетесь в потайной ход Михайловского замка, построенный Павлом I из паранойи. Сейчас 11:30 вечера. Вы сожалеете о том, что не спасли Екатерину, и вместе с заговорщиками продвигаетесь к покоям царя.", "action": "scene11"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
   "scene11": {
    "title": "Смерть Павла",
    "text": "Сочетание репрессий против дворянства, резких изменений в международных союзах и растущей паранойи привело к трагической развязке в Михайловском дворце - крепости, которую сам царь приказал построить, движимый своими навязчивыми страхами. В роковую ночь с 11 на 12 марта 1801 года заговорщики ворвались в императорские покои. Услышав шум, Павел попытался спрятаться за ширмой, но был быстро обнаружен. Николай Зубов нанес царю жестокий удар тяжелым ящиком в висок, лишив его сознания.На рассвете Александр I был провозглашен новым царем, что ознаменовало начало нового царствования.",
    "image_path": "Final-Project_1/Images/11.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Хотя Россия и Франция подписали Тильзитский мир (1807), из-за невыполнения торговой блокады и жажды завоеваний Наполеон решил напасть на Россию.", "action": "scene12"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene12": {
    "title": "Атака Наполеона",
    "text": "Решив захватить Россию, Наполеон нацелился на Москву, намеренно обойдя Санкт-Петербург, политическую столицу империи. Он надеялся на быструю победу, но столкнулся с безжалостной стратегией «выжженной земли»: русские войска отступали, уничтожая все на своем пути: продовольствие, фураж, целые деревни. Бородинское сражение (7 сентября 1812 года) было кровопролитным, но безрезультатным. Несмотря на огромные потери с обеих сторон, русская армия сохранила боеспособность, и Наполеон так и не смог добиться решающего перевеса. Последовавшее затем великое отступление обернулось катастрофой. Сильный холод, голод и постоянные атаки казаков довершили разгром Великой армии. Из 600 000 солдат, переправившихся через Неман в июне, в декабре в живых осталось только 40 000.Сочетание репресс Эта кампания не только ослабила Наполеона, но и стала началом конца его империи, доказав всему миру, что победить Россию на ее собственной ",
    "image_path": "Final-Project_1/Images/12.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "В декабре 1825 года, сразу после смерти Александра I. Вакуум власти между его смертью и восшествием на престол Николая I стал временем для восстания европейски образованных офицеров-аристократов, вернувшихся с либеральными идеями после поражения Наполеона.", "action": "scene13"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene13": {
    "title": "Декабристы",
    "text": "Они подняли голос, требуя конституционной монархии, отмены крепостного права и модернизационных реформ. Ответ только что коронованного Николая I был жестоким и незамедлительным: четыре пушечных выстрела потрясли Сенатскую площадь в Санкт-Петербурге, разогнав повстанцев в кровавой бойне. Репрессии были быстрыми - пять лидеров были казнены в Петропавловской крепости, а 121 повстанец отправлен в сибирскую ссылку, где многие из них погибнут в ледяном остракизме. Этот кровавый эпизод стал переломным моментом в истории: он был одновременно первым организованным вызовом царскому абсолютизму и прелюдией к самому репрессивному правлению XIX века. Несмотря на поражение, декабристы посеяли революционное семя, которое прорастет десятилетия спустя в 1917 году, став символом борьбы за свободу в России.",
    "image_path": "Final-Project_1/Images/13.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Николай I был воплощением самодержца, жестоко подавившего восстание декабристов, свидетелями которого мы только что стали. Теперь вы видите, как он умирает в тот самый момент, когда его армия, которую он считал непобедимой, терпит поражение от современных европейских войск. Ирония ощутима.", "action": "scene14"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene14": {
    "title": "Смерть Николая I",
    "text": "Он правил Россией железным кулаком в течение трех десятилетий, но его авторитаризм в конечном итоге усугубил кризисы империи. Поражение в Крымской войне (1853-1856) обнажило военную и административную отсталость России, которая при нем застряла в прошлом. Конец наступил в березовом кабинете царя в Зимнем дворце. Николай I лежал на диване и кашлял кровью, глядя, как рушится империя, которой он так отчаянно хотел управлять. Его смерть 2 марта 1855 года ознаменовала конец эпохи репрессий, а также стала прелюдией к великим реформам, которые должен был провести его преемник, Александр II.",
    "image_path": "Final-Project_1/Images/14.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "На канале Грибоедова, замаскированный под продавца кваса. Время - 14:15. Царь Александр II возвращается в Зимний дворец после просмотра репетиций гвардии и готов стать свидетелем убийства царя Александра II в 1881 году", "action": "scene15"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene15": {
    "title": "Убийство Александра II ",
    "text": "Царь-реформатор, отменивший крепостное право и модернизировавший Россию, встретил парадоксальную судьбу: пережив шесть покушений, 13 марта 1881 года на него было совершено седьмое. Когда его карета проезжала по Санкт-Петербургу, взорвались две бомбы: первая убила его охранников, вторая, брошенная Игнатием Гриневицким, раздробила ему ноги и живот, и он умер на снегу. Его убийцы - Перовская, Желябов и еще пятеро - были повешены, но это преступление ознаменовало конец либеральных реформ. На месте его гибели возвышается культовый храм Спаса-на-Крови - символ царствования, стремившегося преобразить Россию и в итоге принесенного в жертву на алтарь перемен.",
    "image_path": "Final-Project_1/Images/15.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "После убийства австрийского эрцгерцога Франца Фердинанда Австро-Венгрия объявила войну Сербии 28 июля 1914 года. В ответ Николай II приказал мобилизовать 4,9 миллиона солдат для защиты Сербии. Германия потребовала от России демобилизации и, не получив ее, объявила ей войну 1 августа 1914 года.", "action": "scene16"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene16": {
    "title": "Первая мировая война",
    "text": "Участие России в Первой мировой войне ускорило крах царского режима, превратив империю в первое в мире коммунистическое государство. Смерть «царя-реформатора» в 1881 году предопределила судьбу самодержавия, которое спустя десятилетия нашло свой перелом в окопах Империалистической войны 1914-1918 годов.",
    "image_path": "Final-Project_1/Images/16.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Под руководством Ленина большевики выдвинули простые и радикальные лозунги: «Вся власть советам», «Немедленный мир» и «Земля - крестьянам». Эти требования настолько пришлись по душе рабочим, солдатам и крестьянам, что после войны недовольство привело к свержению царей.", "action": "scene17"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene17": {
    "title": "Возвращение Ленина к власти",
    "text": "После Русско-японской и Первой мировой войн в феврале в Петрограде вспыхнула забастовка рабочих, и, несмотря на тысячи жертв, Николай II отрекся от престола. Благодаря новому Временному правительству Ленин смог вернуться в Россию. Вместе с Троцким он спланировал Октябрьскую революцию. 24-25 октября Военно-революционный комитет организовал одновременный захват Зимнего дворца, телеграфной станции и других ключевых пунктов Петрограда. После создания ЧК (большевистской тайной полиции) под командованием Якова Юровского большевистское руководство в Москве (при ключевом участии Ленина, Свердлова и других лидеров) отдало приказ об убийстве Николая II и его семьи. Ранним утром агенты проникли в подземную камеру, где они содержались, и расстреляли их.",
    "image_path": "Final-Project_1/Images/17.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Поддерживает Сталина в принятии мандата, видя, что Ленин слабеет.", "action": "scene18"},
      {"rect": [400, 580, 300, 100], "text": "Вы вмешиваетесь, чтобы спасти Сталина, вовремя вызываете врача и предотвращаете обширное кровоизлияние в мозг.SЕсли бы Ленин не умер в январе 1924 года и прожил еще десять или пятнадцать лет (например, до середины 1930-х годов)...", "action": "scene36"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene18": {
    "title": "Начало правления Сталина",
    "text": "После победы Красной армии в Гражданской войне (1922) 30 декабря 1922 года был официально провозглашен Союз Советских Социалистических Республик. Когда в мае 1922 года Ленин тяжело заболел, он начал терять политическое влияние; его упадок сил усугубился инсультом в декабре 1922 года, и в конце концов он умер 21 января 1924 года. После смерти Ленина разгорелась внутренняя борьба за лидерство между Леоном Троцким, Николаем Бухариным и другими членами Политбюро. Занимая пост генерального секретаря Коммунистической партии, Иосиф Сталин постепенно укреплял свою власть над соперниками, пока не стал новым неоспоримым лидером Советского Союза.",
    "image_path": "Final-Project_1/Images/18.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Поскольку Сталин стремился оттянуть войну с Германией: советская военная промышленность не была готова. Вы влияете на подписание договора о пакте Риббентропа-Молотова.", "action": "scene19"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene19": {
    "title": "Вторая мировая война",
    "text": "Стремясь оттянуть войну с Германией - поскольку советская военная промышленность была еще не готова, - Сталин согласился подписать пакт Риббентропа-Молотова в августе 1939 года, договор о ненападении между СССР и нацистской Германией. Вскоре после этого, однако, Гитлер начал операцию «Барбаросса» в июне 1941 года. Он считал, что победить Советский Союз будет легко, отчасти из-за признаков слабости, таких как Великая чистка 1930-х годов, которая привела к сокращению советского военного командования, и тяжелая война против Финляндии (1939-1940). Эти представления заставили его поспешно вторгнуться на советскую территорию.",
    "image_path": "Final-Project_1/Images/19.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Позволить Сталину издать приказ 227, чтобы Гитлер не захватил город", "action": "scene20"},
      {"rect": [400, 580, 300, 100], "text": "Из-за внезапной смерти шпиона Рихарда Зорге он не смог сообщить в советскую Ставку, что японские военные не планируют нападать на Советский Союз, что позволило генералу Георгию Жукову перебросить войска с Дальнего Востока в Москву для противодействия немецкому наступлению.", "action": "scene29"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene20": {
    "title": "Блокада Сталинграда",
    "text": "Гитлер рассматривал город Сталинград как ключ к доступу к ресурсам Кавказа, особенно к нефти, но он также рассматривал его как пропагандистский трофей, поскольку он носил имя Сталина. Во время так называемой Великой Отечественной войны эта битва стала самым кровопролитным городским сражением, бои шли дом на дом и улица на улицу. Несмотря на постоянные немецкие бомбардировки и острую нехватку продовольствия, вызванную окружением, советские защитники оказывали ожесточенное сопротивление. В какой-то момент немецкие войска контролировали более 70 % города. Однако в ноябре 1942 года Красная Армия начала операцию «Уран» - крупное контрнаступление, в ходе которого была окружена немецкая 6-я армия, что стало решающим переломным моментом в войне.",
    "image_path": "Final-Project_1/Images/20.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Сталин, по совету маршалов Георгия Жукова, Александра Василевского и вас, решил не начинать преждевременное наступление, а подготовить глубокоэшелонированную оборону, чтобы встретить ожидаемое немецкое наступление под Курском в июле 1943 года.", "action": "scene21"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene21": {
    "title": "Падение нацизма",
    "text": "После победы под Сталинградом в июле 1943 года началась Курская битва, которая считается величайшим танковым сражением в истории. Это было последнее крупное немецкое наступление на Восточном фронте. Сталин, под руководством своих полководцев Жукова и Василевского, приказал глубоко оборонять Курский выступ. Советские войска построили колоссальную оборонительную систему с восемью линиями укреплений, глубиной более 300 км и массивными минными полями.L После разгрома немецких войск под Курском инициатива окончательно перешла в руки советских войск. В июне 1944 года в ходе операции «Багратион» Красная Армия начала сокрушительное наступление, в результате которого была освобождена Беларусь и ускорено продвижение на запад. Наконец, в мае 1945 года, окружив Берлин, СССР добился безоговорочной капитуляции Германии, завершив войну в Европе.",
    "image_path": "Final-Project_1/Images/21.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Сталин умер от обширного геморрагического инсульта, усугубленного задержкой помощи.", "action": "scene22"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene22": {
    "title": "Мандат Никиты Хрущева",
    "text": "Сталину удалось быстро провести индустриализацию СССР и превратить его в сверхдержаву, а также добиться победы над нацистской Германией во Второй мировой войне. Однако его режим укрепился как тоталитарная диктатура, характеризующаяся массовыми репрессиями, включая политические чистки, лагеря принудительного труда (ГУЛАГ) и абсолютный контроль над обществом.LПосле смерти Сталина в 1953 году началась борьба за власть. В итоге победителем стал Никита Хрущев, которому удалось укрепить свое положение в 1955 году после политического устранения Лаврентия Берии (казненного в 1953 году) и смещения Георгия Маленкова. Хрущев способствовал процессу десталинизации: он положил конец массовому террору, способствовал проведению амнистий, частично закрыл систему ГУЛАГа и на 20-м съезде КПСС (1956) публично осудил преступления Сталина.aВо время его правления был увеличен выпуск потребительских товаров и начался короткий период разрядки с Западом в условиях холодной войны. Однако его правительство также столкнулось с сильной напряженностью внутри социалистического блока, например, с восстаниями в Венгрии и Польше в 1956 году. Кроме того, произошел разрыв с Китаем, лидер которого Мао Цзэдун обвинил Хрущева в «ревизионизме». Внутри страны Хрущев провел сельскохозяйственные реформы, направленные на модернизацию села, хотя и с ограниченными результатами.",
    "image_path": "Final-Project_1/Images/22.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Хрущев хотел обогнать США в производстве сельскохозяйственной продукции", "action": "scene23"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene23": {
    "title": "Конец мандата Никиты Хрущева",
    "text": "Кампания «Девственные земли», начатая в 1954 году с целью резкого увеличения производства зерна в Казахстане и Сибири, привела к эрозии и истощению почв, что привело к острой нехватке зерна и голоду в 1963 году. Не имея возможности удовлетворить свои потребности в продовольствии, СССР был вынужден закупать большие объемы пшеницы в США. LВ то же время, во время октябрьского ракетного кризиса 1962 года, решение об установке ядерных ракет на Кубе было призвано укрепить советский престиж по отношению к США и компенсировать стратегическое превосходство НАТО. Разрешение этого кризиса, воспринятое как поражение Хрущева по отношению к Джону Ф. Кеннеди, подорвало его имидж непогрешимого лидера и усилило недовольство внутри страны. Сочетание экономических катастроф и, казалось бы, импульсивных политических решений привело к расколу поддержки. Наконец, в октябре 1964 года Хрущев был отстранен от власти своими же товарищами.",
    "image_path": "Final-Project_1/Images/23.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Приход Михаила Горбачева для спасения режима путем срочного обновления (перестройка и гласность), направленного на внедрение рыночных элементов, прозрачности и политической либерализации.", "action": "scene24"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene24": {
    "title": "Крупная политическая неудача",
    "text": "La política de apertura y reestructuración condujo a la rápida deslegitimación del Partido Comunista, y la economía sufrió hiperinflación y déficit. En el plano internacional, el final de la Guerra Fría se cimentó con los acuerdos de desarme y la retirada de las tropas de Afganistán, y contribuyó a la caída de los regímenes comunistas en Europa del Este (1989). En el plano interno, las repúblicas soviéticas aprovecharon la oportunidad para recuperar su soberanía, y el fallido golpe de Estado de agosto de 1991 aceleró el debilitamiento de Gorbachov frente a Boris Yeltsin. ",
    "image_path": "Final-Project_1/Images/24.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Поддержите решение Ельцина подписать Белавежские соглашения вместе с лидерами Украины (Леонид Кравчук) и Беларуси (Станислав Шушкевич). Для того чтобы однозначно поддержать создание независимой Российской Федерации.", "action": "scene25"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene25": {
    "title": "Конец Советского Союза",
    "text": "Официальный конец СССР (25 декабря 1991 года): В конце декабря 1991 года, после подписания Белавежских соглашений, Михаил Горбачев ушел в отставку с поста президента Советского Союза, положив конец существованию советского государства. Быстрый переход от плановой экономической системы к частично либерализованной рыночной системе вызвал сильную гиперинфляцию, резкий рост безработицы и резкое снижение уровня жизни населения. Под руководством Бориса Ельцина вся власть была сосредоточена в Москве, были заложены основы нового российского государства, а старая Коммунистическая партия была распущена, уступив место многочисленным политическим формированиям.",
    "image_path": "Final-Project_1/Images/25.jpg",
    "buttons": [
    
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene26": {
    "title": "Город Патаноса",
    "text": "Победа России над Швецией. Однако замерзшая земля помешает рыть фундамент. Речной транспорт (жизненно необходимый для доставки материалов) был бы заблокирован льдом.ПСмертность рабочих была ужасной из-за переохлаждения, голода и болезней. Фундамент крепости Святого Петра и Павла был бы ненадежным.оВойска окопались бы в захваченном Нюншанце и ждали весны 1704 года, чтобы основать Санкт-Петербург из-за возможного зимнего контрнаступления.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "повлиять на Петра, чтобы он построил островную крепость для защиты входа в Неву. А также построить на острове корабли для защиты Балтики.", "action": "scene27"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene27": {
    "title": "Преждевременная смерть Петра Великого ",
    "text": "Петр Великий мертв! Строительство было немедленно прекращено. Рабочие (и без того сократившиеся) разбежались или были переведены на другую работу. Двор и дворянство требовали возвращения в Москву, считая проект «дорогостоящей глупостью». Нюншанц вновь станет пограничным форпостом. После смерти Петра его стали называть Петром на болоте.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Continue", "action": "scene28"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene28": {
    "title": "Конец ",
    "text": "Не было бы Петербурга, он был бы забытым регионом.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Go to Scene 4", "action": "scene29"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene29": {
    "title": "Операция «Барбаросса»",
    "text": "В конце ноября 1941 года немецкие войска занимают столицу. Сталин и правительство переезжают в Куйбышев (Самару),\n но моральные последствия оказываются катастрофическими. Группа армий «Север» перенаправляет части в Москву для усиления блокады \nЛенинграда, и в январе 1943 года город падает. Восемьдесят пять процентов славянского населения было истреблено или обращено в рабство.\n Вскоре после этого город переименовывают в «Ингерманландию».Нацисты захватывают Кавказ, где находились запасы нефти (90%).",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Армия Вермахта продвигается на Ближний Восток.", "action": "scene30"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene30": {
    "title": "Падение Советского Союза",
    "text": "Оказавшись загнанной в угол немцами на обоих фронтах, Япония в августе 1942 года врывается на российский Дальний Восток, пользуясь случаем,\n чтобы напасть и на Советский Союз. Она захватывает Владивосток, закрывая последний советский порт на Тихом океане. В 1943 году Сталин был схвачен и казнен в Берлине.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [

      {"rect": [400, 580, 200, 50], "text": "Гитлер запасается советскими ресурсами для вторжения в Европу", "action": "scene31"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene31": {
    "title": "Экспансия нацизма",
    "text": "Германия распространяет свое господство от Франции до Урала. Великобритания соглашается на унизительный мир, уступая требованиям\n Гитлера сдать Гибралтар и Мальту. Япония устанавливает свой контроль над Китаем, Индией и Океанией. В 1946 году США подписывают перемирие, \nсбросив атомные бомбы на Хиросиму и Нагасаки, но не добившись полной капитуляции Японии, которая закрепилась на азиатском материке.\n С этого момента США заняли изоляционистскую позицию и превратили доктрину Монро в оборонительную стратегию. Латинская Америка тем временем попала под влияние нацистов,\n особенно Аргентина и Бразилия.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Попытка достичь соглашения", "action": "scene32"},
      {"rect": [400, 580, 600, 50], "text": "Борьба до победного конца", "action": "scene33"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene32": {
    "title": "Третья мировая война. ",
    "text": "С Гитлером было достигнуто соглашение, однако семь лет спустя, усилив свои войска - война с Советским Союзом истощила их ряды,\n - он развязал третью мировую войну. С Японией в качестве союзника ему пришлось атаковать только на одном европейском фронте. \nС падением Европы пали и Соединенные Штаты. Имея достаточно времени, они сумели придумать, как сделать ядерное оружие, и одним махом уничтожили США и Японию,\n чтобы, по словам Гитлера, «очистить» мир. В последующие годы он уничтожил большую часть населения Латинской Америки, Китая, Австралии и других стран мира.\n Миром стал править нацистский режим.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene33": {
    "title": "Дорогая победа",
    "text": "Благодаря применению США ядерного оружия против эффективных точек и с помощью армии союзников Гитлер был побежден, но потери были настолько велики,\n что армии практически не осталось. Из-за распространения нацистов на Россию, землю и чрезмерного применения ядерного оружия, необходимого для победы над нацистами,\n ядерная зима сделала жизнь в Европе практически невозможной.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene34": {
    "title": "Победа Карла XII",
    "text": "Карл XII Шведский не упустил возможности. После вторжения в Россию в 1708 году, вместо того чтобы идти в Украину, он направил свои войска на север,\n чтобы взять Санкт-Петербург. Не имея Кронштадта и действующего флота, шведы легко блокировали бы Неву. Город, который еще только строился и имел слабую сухопутную\n оборону, пал бы в течение нескольких недель.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Continue", "action": "scene35"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene35": {
    "title": "Забытое место",
    "text": "Этот регион остается резервным портом, а из-за климата и болезней на карте образовалась пустая область.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene36": {
    "title": "Увольнение Сталина",
    "text": "Ленин не доверял Сталину. В своем «Политическом завещании» 1922 года он назвал его «чрезмерно грубым» и призвал сместить его с поста генерального секретаря. Более того, Ленин поддерживал НЭП (сочетание контролируемого капитализма и мелких частных предприятий) как прагматичную меру по восстановлению экономики после гражданской войны. Таким образом, Советский Союз был бы менее индустриализованным, но более стабильным и без сталинского террора.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Вторая мировая война только началась, и вы советуете Ленину защищаться от идей нацизма.", "action": "scene37"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene37": {
    "title": "Союз против наступления нацизма",
    "text": "Нацистско-советский пакт не будет подписан: Ленин и Троцкий рассматривали фашизм как «главного врага» (а не как временного союзника, как это делал Сталин). СССР стремился бы к союзу с демократическими державами: он искал бы соглашения с Францией и Великобританией, чтобы противостоять Гитлеру.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Поддержка Германии с востока в поддержку Польши, что привело к войне на два фронта для Гитлера с 1939 года.", "action": "scene38"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene38": {
    "title": "Начало II мировой войны",
    "text": "СССР надавил бы на восток, заставив Германию сражаться с первого дня, но из-за недостатка промышленного потенциала немцы постепенно победили Советы и захватили часть территории",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Продолжать борьбу с нацистами, отказаться от заключения договора", "action": "scene39"},
      {"rect": [400, 580, 200, 50], "text": "Вы видите, что ситуация не очень хорошая и реальнее всего заключить перемирие.", "action": "scene42"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene39": {
    "title": "Немецкое наступление",
    "text": "Из-за отсутствия промышленного производства фронт боевых действий не представлял проблем, поэтому они были на грани достижения Москвы.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Обращение за помощью к союзникам", "action": "scene40"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene40": {
    "title": "Падение Ленинграда",
    "text": "Это оказывается бесполезным, так как у них нет средств для отражения ожидаемой операции «Барбаросса» (май 1941 года). Гитлер начинает тотальное вторжение в СССР на год раньше запланированного срока, ставя перед собой более амбициозные цели: дойти до Урала к 1942 году. Он добивается беспрецедентного прорыва: не сумев мобилизовать сибирские резервы и захватив заводы, Москва падает в августе 1941 года. После этого Германия создает Рейхскомиссариат Московии, эксплуатирует ресурсы и обращает население в рабство.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Continue", "action": "scene41"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene41": {
    "title": "Немецкое наступление",
    "text": "Из-за отсутствия промышленного производства фронт боевых действий не представлял проблем, поэтому они были на грани достижения Москвы.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Обращение за помощью к союзникам", "action": "scene40"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene42": {
    "title": "Новая операция",
    "text": "Однако Гитлер понимал, что промышленный потенциал России слишком низок и что она не способна вести тотальную войну. Он начинает операцию «Рыжая борода».",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Continue", "action": "scene43"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene43": {
    "title": "Захват Советского Союза",
    "text": "Он ставит перед собой более амбициозные цели: дойти до Урала к 1942 году. Он добивается беспрецедентного прорыва: не сумев мобилизовать сибирские резервы и захватить заводы, Москва падает в августе 1941 года. Германия создает Рейхскомиссариат Московии, эксплуатирует ресурсы и делает из населения рабов.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene44": {
    "title": "Немецкое наступление",
    "text": "Из-за отсутствия промышленного производства фронт боевых действий не представлял проблем, поэтому они были на грани достижения Москвы.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Обращение за помощью к союзникам", "action": "scene40"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene45": {
    "title": "Немецкое наступление",
    "text": "Из-за отсутствия промышленного производства фронт боевых действий не представлял проблем, поэтому они были на грани достижения Москвы.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Обращение за помощью к союзникам", "action": "scene40"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene46": {
    "title": "Немецкое наступление",
    "text": "Из-за отсутствия промышленного производства фронт боевых действий не представлял проблем, поэтому они были на грани достижения Москвы.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Обращение за помощью к союзникам", "action": "scene40"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene47": {
    "title": "Немецкое наступление",
    "text": "Из-за отсутствия промышленного производства фронт боевых действий не представлял проблем, поэтому они были на грани достижения Москвы.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Обращение за помощью к союзникам", "action": "scene40"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene48": {
    "title": "Немецкое наступление",
    "text": "Из-за отсутствия промышленного производства фронт боевых действий не представлял проблем, поэтому они были на грани достижения Москвы.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Обращение за помощью к союзникам", "action": "scene40"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene49": {
    "title": "Немецкое наступление",
    "text": "Из-за отсутствия промышленного производства фронт боевых действий не представлял проблем, поэтому они были на грани достижения Москвы.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Обращение за помощью к союзникам", "action": "scene40"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene50": {
    "title": "Немецкое наступление",
    "text": "Из-за отсутствия промышленного производства фронт боевых действий не представлял проблем, поэтому они были на грани достижения Москвы.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Обращение за помощью к союзникам", "action": "scene40"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]

  },
    "scene51": {
    "title": "Немецкое наступление",
    "text": "Из-за отсутствия промышленного производства фронт боевых действий не представлял проблем, поэтому они были на грани достижения Москвы.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Обращение за помощью к союзникам", "action": "scene40"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene52": {
    "title": "Немецкое наступ",
    "text": "Из-за отсутствия промышленного производства фронт боевых действий не представлял проблем, поэтому они были на грани достижения Москвы.",
    "image_path": "Final-Project_1/Scenes/scene1/Images/scene1.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Обращение за помощью к союзникам", "action": "scene40"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  }
}
