{
  "menu": {
    "title": null,
    "text": "Main Menu",
    "image_path": "Final-Project_1/Background Image/image1.png",
    "buttons": [
      {"rect": ["center", "auto", 300, 50], "text": "Continue", "action": "continue"},
      {"rect": ["center", "auto", 300, 50], "text": "New Game", "action": "new_game"},
      {"rect": ["center", "auto", 300, 50], "text": "Exit", "action": "exit"}
    ],
    "music": "Final-Project_1/Sounds/Musics/AoE2_Main_theme.mp3"
  },
  "scene1": {
    "title": "Введение",
    "text": "Сегодня вы станете бессмертным путешественником во времени, теперь вы отправитесь в Санкт-Петербург, но самый главный вопрос не где, а когда.\n В поисках правды, подлинной истории этого города. Испытайте на себе, насколько ваши решения влияют на историю и насколько они отличаются от реальности.",
    "image_path": "Final-Project_1/Images/1.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Continue", "tooltip_text": "Continue", "action": "scene2"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene2": {
    "title": "До основания Санкт-Петербурга",
    "text": "Добро пожаловать в 1700 год, когда в Англии разгоралась Северная война (1700-1721). Этот конфликт, инициированный Петром I и коалицией (Саксония-Польша, Дания-Норвегия), был направлен главным образом на то, чтобы сломить шведское господство на Балтийском море и вернуть России выход к этому морю.",
    "image_path": "Final-Project_1/Images/2.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Выступите в роли наблюдателя и проследите за ходом войны между Российской империей и шведами за господство на Балтийском море.", "action": "scene3"},
      {"rect": [600, 580, 300, 100], "text": "Вступайте в армию, чтобы ускорить процесс завоевания новой территории, необходимой для развития Российской империи.", "action": "scene26"},
      {"rect": [600, 580, 300, 100], "text": "Он выступает в роли советника и оказывает влияние на Петра I, чтобы тот искал место для окна в Европу, новый город, на который он рассчитывал.", "action": "scene101"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene3": {
    "title": "Окно в Европу",
    "text": "Дата: 16 мая (27 мая по григорианскому календарю) 1703 года. Место: Заячий остров (Заячий), дельта реки Невы, Балтийское море. Ситуация: Петр I только что захватил шведскую крепость Ниенсканс.\n Он отчаянно нуждается в балтийском порте и «окне в Европу». Место это болотистое, нездоровое, отдаленное и с жестоким климатом. Советники предупреждают его о трудностях.",
    "image_path": "Final-Project_1/Images/3.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Замаскироваться под голландского купца и повлиять на Петра, чтобы тот построил островную крепость для защиты входа в Неву. А также построить на острове корабли для защиты Балтики", "action": "scene4"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene4": {
    "title": "Начало города",
    "text": "Для помощи в строительстве было перевезено множество слуг, многие умерли от голода и холода. Хотя в последующие годы Петр тяжело заболел, здания стали эмблемой города, а крепость была завершена в 1706 году.",
    "image_path": "Final-Project_1/Images/4.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Наблюдение за ходом войны со шведами", "action": "scene5"},
      {"rect": [400, 580, 300, 100], "text": "Пётр I распорядился ещё в самом начале строительства создать полноценную логистическую сеть с регулярными продовольственными и тёплыми поставками для всех трудящихся: были организованы стационарные склады вблизи стройплощадки, зимние казармы с печным отоплением и система дневных рационов с учётом калорийности в соответствии с тяжестью работ.", "action": "scene58"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene5": {
    "title": "Шведское наступление",
    "text": "Карл XII Шведский, победив Августа II Польского, вступает в Россию с 35 000 войск. Посмотрите, как русские применяют «выжженную землю», из-за чего Карл XII направляет свою армию в Украину в поисках союзников и снабжения.\n Из-за зимы многие шведские солдаты замерзают насмерть, а в битве при Лесной 9 октября 1708 года Карл теряет свой обоз с припасами. Карл XII ранен в ногу во время экзамена",
    "image_path": "Final-Project_1/Images/5.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Вы оказываетесь в роли помощника хирурга в русском лагере, чтобы стать свидетелем одного из самых решающих моментов Северной войны - Полтавской битвы.", "action": "scene6"},
      {"rect": [400, 580, 300, 100], "text": "Вместо того, чтобы углубиться на российскую территорию после потери своих припасов, Карл XII в октябре 1708 года решает на мгновение остановить наступление и укрепить оборонительную позицию на границе Украины, обеспечив стабильную базу для пополнения запасов и вербовки союзников-казаков перед продолжением кампании", "action": "scene54"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene6": {
    "title": " Полтавская битва 8 июля 1709 года",
    "text": "Здесь в 1709 г. вы увидите, как Петр I подготовил целую тактическую систему, оснащенную 102 пушками. Тем временем Карл XII (на носилках из-за ранения в ногу) приказал атаковать, но шведы прорвали линию фронта, что привело их в ловушку, и продвинулись на открытую равнину перед русским лагерем, где русские с помощью пушек уничтожили его армию.\n Карла XII эвакуируют его драбанты (королевская гвардия).",
    "image_path": "Final-Project_1/Images/6.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Вы материализуетесь на набережной Невы, Петр I только что издал Указ № 2021, официально переносящий столицу из Москвы в Санкт-Петербург.", "action": "scene7"},
      {"rect": [400, 580, 300, 100], "text": "Несмотря на свое ранение, Карл XII делегирует тактическое командование своему великому маршалу артиллерии и приказывает шведской батарее сначала открыть огонь из 102 русских орудий и одновременно развернуть кавалерию широким обходным маневром по холмам справа от фронта", "action": "scene59"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene7": {
    "title": "Перенос столицы",
    "text": "Петр издает указ: «Всем знатным семьям до 1715 года построить здесь свои дома», поскольку никто не хочет переезжать в болотистую местность с ужасным климатом. В результате строятся дворцы в стиле барокко, такие как Миншиков, до сих пор стоящий на Васильевском острове.\n Из Амстердама ежегодно прибывает 300 торговых судов (в 1703 году их было всего 20). На острове Котлин, в будущем Кронштадте, строится первая императорская таможня. Православная церковь отказывается перевести митрополита в другое место, мотивируя это тем, что «Петербург - город без святых». В ответ Петр в 1713 году в качестве символического жеста основывает Александро-Невский монастырь.",
    "image_path": "Final-Project_1/Images/7.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Проникнув в дом в качестве врача, вы становитесь свидетелем смерти Петра I в опочивальне Зимнего дворца. Перед смертью он попросил листок бумаги, но успел написать только «Оставить все...» (это должно было обозначить преемника), но завершить свое желание не смог.", "action": "scene8"},
      {"rect": [400, 580, 300, 100], "text": "Проникнув в дом под видом лекаря, вы становитесь свидетелем смерти Петра I в опочивальне Зимнего дворца. Перед тем как он умрет, вы вмешиваетесь и спасаете его.", "action": "scene44"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene8": {
    "title": "Екатерина I",
    "text": "Екатерина I была провозглашена императрицей Преображенской гвардией во главе с Меньшиковым. Она основала Петербургскую академию наук (1725), а город постепенно украшался. Несмотря на это, консервативно настроенные дворяне хотели вернуть столицу в Москву.",
    "image_path": "Final-Project_1/Images/8.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Дождавшись 1762 года, вы появляетесь в садах Зимнего дворца, переодетый офицером Измайловской гвардии. Это рассвет переворота, который изменит судьбу России. Переворот против Петра III (внука Петра Великого)", "action": "scene9"},
      {"rect": [400, 580, 300, 100], "text": "Екатерина I, чтобы укрепить Санкт-Петербург как столицу, издает в 1726 году указ о “Образцовом городе”, который предоставляет городу налоговые льготы, субсидии на развитие искусства и совет городских регентов с широкими полномочиями, тем самым ограничивая власть консервативной знати", "action": "scene61"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene9": {
    "title": "Catalina II",
    "text": "Екатерина II предстала перед Измайловским и Преображенским полками, одетая в военную форму, и обратилась к войскам с речью, чтобы заручиться их поддержкой. Тем временем ее мужа, Петра III, застали пьяным в его дворце в Ораниенбауме и под угрозой отречения вынудили отречься от престола. Через несколько дней, 17 июля 1762 года, он был убит Алексеем Орловым, что закрепило восхождение Екатерины на престол.\n Придя к власти, Екатерина Великая предприняла масштабные преобразования в России, особенно в Санкт-Петербурге, где заменила деревянные постройки величественными каменными зданиями. Она заказала строительство Зимнего дворца (автор Растрелли), основала Эрмитаж (1764) как свою частную коллекцию и учредила Смольный институт, ставший пионером в области образования для дворянок.\n Кроме того, в честь наследия своего предшественника он воздвиг культовый памятник Петру I, известный как Медный всадник (1782), символ прогресса и величия Российской империи.",
    "image_path": "Final-Project_1/Images/9.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "В личных покоях Зимнего дворца, переодетый личным врачом Екатерины II. Вы наблюдаете за тем, как 67-летняя императрица мучается после инсульта.", "action": "scene10"},
      {"rect": [400, 580, 300, 100], "text": "Вместо того, чтобы приказать убить Петра III, Екатерина II в июле 1762 года приказывает отправить его живым в герцогство Гольштейн —ее родину— под строгую прусскую опеку, гарантируя его выживание, но выводя из политической игры России", "action": "scene63"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene10": {
    "title": "Смерть Екатерины II ",
    "text": "Екатерина II безжизненно лежала в своей постели, ее мощный голос замолчал навсегда. В 1792 году она тайно написала политическое завещание, содержащее взрывоопасные распоряжения: Она лишила наследства своего сына Павла, которого считала «негодным к управлению», и назначила наследником своего внука Александра, будучи уверенной, что он будет «править в соответствии с идеалами Просвещения».\n Павел I, обнаружив документ, поднял его перед свидетелями с дрожащими от ярости руками, и пламя сожгло последние слова его матери вместе с ее видением современной России. Правление Павла I в России (1796-1801) было коротким, бурным и авторитарным периодом.",
    "image_path": "Final-Project_1/Images/10.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Вы направляетесь в потайной ход Михайловского замка, построенный Павлом I из паранойи. Сейчас 11:30 вечера. Вы сожалеете о том, что не спасли Екатерину, и вместе с заговорщиками продвигаетесь к покоям царя.", "action": "scene11"},
      {"rect": [400, 580, 300, 100], "text": "Обнаружив секретное завещание, Павел I решает уважать последнюю волю Екатерины II, соглашается отказаться от своих собственных прав на престол и провозглашает своего сына Александра соправителем при режиме просвещенного совместного правления.", "action": "scene65"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
   "scene11": {
    "title": "Смерть Павла",
    "text": "Сочетание репрессий против дворянства, резких изменений в международных союзах и растущей паранойи привело к трагической развязке в Михайловском дворце - крепости, которую сам царь приказал построить, движимый своими навязчивыми страхами. В роковую ночь с 11 на 12 марта 1801 года заговорщики ворвались в императорские покои.\n Услышав шум, Павел попытался спрятаться за ширмой, но был быстро обнаружен. Николай Зубов нанес царю жестокий удар тяжелым ящиком в висок, лишив его сознания.На рассвете Александр I был провозглашен новым царем, что ознаменовало начало нового царствования.",
    "image_path": "Final-Project_1/Images/11.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Хотя Россия и Франция подписали Тильзитский мир (1807), из-за невыполнения торговой блокады и жажды завоеваний Наполеон решил напасть на Россию.", "action": "scene12"},
      {"rect": [400, 580, 300, 100], "text": "В марте 1801 года царь Павел I, осознавая растущую враждебность знати и недоверие, посеянное его авторитарными реформами, решает срочно созвать “Коронный совет”, состоящий из представителей князей, высших должностных лиц и некоторых просвещенных реформаторов. обещает Статут дворянских свобод, который ограничьте свои личные полномочия и согласитесь пересмотреть его наиболее спорные указы.", "action": "scene67"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene12": {
    "title": "Атака Наполеона",
    "text": "Решив захватить Россию, Наполеон нацелился на Москву, намеренно обойдя Санкт-Петербург, политическую столицу империи. Он надеялся на быструю победу, но столкнулся с безжалостной стратегией «выжженной земли»: русские войска отступали, уничтожая все на своем пути: продовольствие, фураж, целые деревни. Бородинское сражение (7 сентября 1812 года) было кровопролитным, но безрезультатным.\n Несмотря на огромные потери с обеих сторон, русская армия сохранила боеспособность, и Наполеон так и не смог добиться решающего перевеса. Последовавшее затем великое отступление обернулось катастрофой. Сильный холод, голод и постоянные атаки казаков довершили разгром Великой армии. Из 600 000 солдат, переправившихся через Неман в июне, в декабре в живых осталось только 40 000. Сочетание репрессЭта кампания не только ослабила Наполеона, но и стала началом конца его империи, доказав всему миру, что победить Россию на ее собственной ",
    "image_path": "Final-Project_1/Images/12.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "В декабре 1825 года, сразу после смерти Александра I. Вакуум власти между его смертью и восшествием на престол Николая I стал временем для восстания европейски образованных офицеров-аристократов, вернувшихся с либеральными идеями после поражения Наполеона.", "action": "scene13"},
      {"rect": [400, 580, 300, 100], "text": "После кровавой Бородинской победы Наполеон приказывает вместо продвижения к Москве своей армии перегруппироваться и создать оборонительную линию вокруг Смоленска с достаточными запасами продовольствия и фуража, а также отправляет эмиссаров к царю Александру I, чтобы предложить перемирие, заключенное при посредничестве до наступления зимы", "action": "scene68"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene13": {
    "title": "Декабристы",
    "text": "В 1825 г.они подняли голос, требуя конституционной монархии, отмены крепостного права и модернизационных реформ. Ответ только что коронованного Николая I был жестоким и незамедлительным: четыре пушечных выстрела потрясли Сенатскую площадь в Санкт-Петербурге, разогнав повстанцев в кровавой бойне.\n Репрессии были быстрыми - пять лидеров были казнены в Петропавловской крепости, а 121 повстанец отправлен в сибирскую ссылку, где многие из них погибнут в ледяном остракизме. Этот кровавый эпизод стал переломным моментом в истории: он был одновременно первым организованным вызовом царскому абсолютизму и прелюдией к самому репрессивному правлению XIX века. Несмотря на поражение, декабристы посеяли революционное семя, которое прорастет десятилетия спустя в 1917 году, став символом борьбы за свободу в России.",
    "image_path": "Final-Project_1/Images/13.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Николай I был воплощением самодержца, жестоко подавившего восстание декабристов, свидетелями которого мы только что стали. Теперь вы видите, как он умирает в тот самый момент, когда его армия, которую он считал непобедимой, терпит поражение от современных европейских войск. Ирония ощутима.", "action": "scene14"},
      {"rect": [400, 580, 300, 100], "text": "Вместо того, чтобы убивать восставших с помощью канонады, Николай I решает предложить им немедленный диалог и убеждает Сенат созвать Консультативное Учредительное собрание, гарантируя условную амнистию в обмен на отказ от восстания и участие в разработке реформ.", "action": "scene70"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene14": {
    "title": "Смерть Николая I",
    "text": "Он правил Россией железным кулаком в течение трех десятилетий, но его авторитаризм в конечном итоге усугубил кризисы империи. Поражение в Крымской войне (1853-1856) обнажило военную и административную отсталость России, которая при нем застряла в прошлом. Конец наступил в березовом кабинете царя в Зимнем дворце. Николай I лежал на диване и кашлял кровью, глядя, как рушится империя, которой он так отчаянно хотел управлять.\n Его смерть 2 марта 1855 года ознаменовала конец эпохи репрессий, а также стала прелюдией к великим реформам, которые должен был провести его преемник, Александр II.",
    "image_path": "Final-Project_1/Images/14.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "На канале Грибоедова, замаскированный под продавца кваса. Время - 14:15. Царь Александр II возвращается в Зимний дворец после просмотра репетиций гвардии и готов стать свидетелем убийства царя Александра II в 1881 году", "action": "scene15"},
      {"rect": [400, 580, 300, 100], "text": "Потерпевший поражение в Крымской войне и осознающий упадок России, Николай I созывает в декабре 1854 года Большой Реформистский государственный совет, назначая либеральных и прогрессивных военных министров для немедленной разработки Освобождения крепостных и реформы армии под надзором двухпалатной комиссии., далее обещая будущую Конституцию о 'фундаментальных законах' до его смерти.", "action": "scene72"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene15": {
    "title": "Убийство Александра II ",
    "text": "Царь-реформатор, отменивший крепостное право и модернизировавший Россию, встретил парадоксальную судьбу: пережив шесть покушений, 13 марта 1881 года на него было совершено седьмое. Когда его карета проезжала по Санкт-Петербургу, взорвались две бомбы: первая убила его охранников, вторая, брошенная Игнатием Гриневицким, раздробила ему ноги и живот, и он умер на снегу.\n Его убийцы - Перовская, Желябов и еще пятеро - были повешены, но это преступление ознаменовало конец либеральных реформ. На месте его гибели возвышается культовый храм Спаса-на-Крови - символ царствования, стремившегося преобразить Россию и в итоге принесенного в жертву на алтарь перемен.",
    "image_path": "Final-Project_1/Images/15.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "После убийства австрийского эрцгерцога Франца Фердинанда Австро-Венгрия объявила войну Сербии 28 июля 1914 года. В ответ Николай II приказал мобилизовать 4,9 миллиона солдат для защиты Сербии. Германия потребовала от России демобилизации и, не получив ее, объявила ей войну 1 августа 1914 года.", "action": "scene16"},
      {"rect": [400, 580, 300, 100], "text": "После шестого покушения в 1880 году Александр II, под давлением своих министров и личного секретаря Лорис-Меликова, принимает судьбоносное решение: откладывает поездку 13 марта 1881 года и подписывает проект Конституционного Указа, вводящий ограниченные народные представительства и законодательную инициативу для Государственного совета — первый шаг к конституционной монархии в России.", "action": "scene74"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene16": {
    "title": "Первая мировая война",
    "text": "Участие России в Первой мировой войне ускорило крах царского режима, превратив империю в первое в мире коммунистическое государство. Смерть «царя-реформатора» в 1881 году предопределила судьбу самодержавия, которое спустя десятилетия нашло свой перелом в окопах Империалистической войны 1914-1918 годов.",
    "image_path": "Final-Project_1/Images/16.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Под руководством Ленина большевики выдвинули простые и радикальные лозунги: «Вся власть советам», «Немедленный мир» и «Земля - крестьянам». Эти требования настолько пришлись по душе рабочим, солдатам и крестьянам, что после войны недовольство привело к свержению царей.", "action": "scene17"},
      {"rect": [400, 580, 300, 100], "text": "В 1914 году, вместо немедленного вступления в войну после убийства Франца Фердинанда, Николай II принимает предложение министра финансов Коковцова и великого князя Николая Николаевича: объявляет нейтралитет России, ограничивая участие дипломатической поддержкой Сербии и поставками оружия союзникам, но не мобилизует армию.", "action": "scene77"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene17": {
    "title": "Возвращение Ленина к власти",
    "text": "После Русско-японской и Первой мировой войн в феврале в 1917 г. в Петрограде вспыхнула забастовка рабочих, и, несмотря на тысячи жертв, Николай II отрекся от престола. Благодаря новому Временному правительству Ленин смог вернуться в Россию. Вместе с Троцким он спланировал Октябрьскую революцию. 24-25 октября Военно-революционный комитет организовал одновременный захват Зимнего дворца, телеграфной станции и других ключевых пунктов Петрограда.\n После создания ЧК (большевистской тайной полиции) под командованием Якова Юровского большевистское руководство в Москве (при ключевом участии Ленина, Свердлова и других лидеров) отдало приказ об убийстве Николая II и его семьи. Ранним утром агенты проникли в подземную камеру, где они содержались, и расстреляли их.",
    "image_path": "Final-Project_1/Images/17.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Поддерживает Сталина в принятии мандата, видя, что Ленин слабеет.", "action": "scene18"},
      {"rect": [400, 580, 300, 100], "text": "Вы вмешиваетесь, чтобы спасти Сталина, вовремя вызываете врача и предотвращаете обширное кровоизлияние в мозг.SЕсли бы Ленин не умер в январе 1924 года и прожил еще десять или пятнадцать лет (например, до середины 1930-х годов)...", "action": "scene36"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene18": {
    "title": "Начало правления Сталина",
    "text": "После победы Красной армии в Гражданской войне (1922) 30 декабря 1922 года был официально провозглашен Союз Советских Социалистических Республик. Когда в мае 1922 года Ленин тяжело заболел, он начал терять политическое влияние; его упадок сил усугубился инсультом в декабре 1922 года, и в конце концов он умер 21 января 1924 года. После смерти Ленина разгорелась внутренняя борьба за лидерство между Леоном Троцким, Николаем Бухариным и другими членами Политбюро.\n Занимая пост генерального секретаря Коммунистической партии, Иосиф Сталин постепенно укреплял свою власть над соперниками, пока не стал новым неоспоримым лидером Советского Союза.",
    "image_path": "Final-Project_1/Images/18.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Поскольку Сталин стремился оттянуть войну с Германией: советская военная промышленность не была готова. Вы влияете на подписание договора о пакте Риббентропа-Молотова.", "action": "scene19"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene19": {
    "title": "Вторая мировая война",
    "text": "Стремясь оттянуть войну с Германией - поскольку советская военная промышленность была еще не готова, - Сталин согласился подписать пакт Риббентропа-Молотова в августе 1939 года, договор о ненападении между СССР и нацистской Германией. Вскоре после этого, однако, Гитлер начал операцию «Барбаросса» в июне 1941 года. Он считал, что победить Советский Союз будет легко, отчасти из-за признаков слабости, таких как Великая чистка 1930-х годов, которая привела к сокращению\n советского военного командования, и тяжелая война против Финляндии (1939-1940).\n Эти представления заставили его поспешно вторгнуться на советскую территорию.",
    "image_path": "Final-Project_1/Images/19.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Позволить Сталину издать приказ 227, чтобы Гитлер не захватил город", "action": "scene20"},
      {"rect": [400, 580, 300, 100], "text": "Из-за внезапной смерти шпиона Рихарда Зорге он не смог сообщить в советскую Ставку, что японские военные не планируют нападать на Советский Союз, что позволило генералу Георгию Жукову перебросить войска с Дальнего Востока в Москву для противодействия немецкому наступлению.", "action": "scene29"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene20": {
    "title": "Блокада Сталинграда",
    "text": "Гитлер рассматривал город Сталинград как ключ к доступу к ресурсам Кавказа, особенно к нефти, но он также рассматривал его как пропагандистский трофей, поскольку он носил имя Сталина. Во время так называемой Великой Отечественной войны эта битва стала самым кровопролитным городским сражением, бои шли дом на дом и улица на улицу.\n Несмотря на постоянные немецкие бомбардировки и острую нехватку продовольствия, вызванную окружением, советские защитники оказывали ожесточенное сопротивление. В какой-то момент немецкие войска контролировали более 70 % города. Однако в ноябре 1942 года Красная Армия начала операцию «Уран» - крупное контрнаступление, в ходе которого была окружена немецкая 6-я армия, что стало решающим переломным моментом в войне.",
    "image_path": "Final-Project_1/Images/20.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Сталин, по совету маршалов Георгия Жукова, Александра Василевского и вас, решил не начинать преждевременное наступление, а подготовить глубокоэшелонированную оборону, чтобы встретить ожидаемое немецкое наступление под Курском в июле 1943 года.", "action": "scene21"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene21": {
    "title": "Падение нацизма",
    "text": "После победы под Сталинградом в июле 1943 года началась Курская битва, которая считается величайшим танковым сражением в истории. Это было последнее крупное немецкое наступление на Восточном фронте. Сталин, под руководством своих полководцев Жукова и Василевского, приказал глубоко оборонять Курский выступ. Советские войска построили колоссальную оборонительную систему с восемью линиями укреплений, глубиной более 300 км и массивными минными полями.\n После разгрома немецких войск под Курском инициатива окончательно перешла в руки советских войск. В июне 1944 года в ходе операции «Багратион» Красная Армия начала сокрушительное наступление, в результате которого была освобождена Беларусь и ускорено продвижение на запад. Наконец, в мае 1945 года, окружив Берлин, СССР добился безоговорочной капитуляции Германии, завершив войну в Европе.",
    "image_path": "Final-Project_1/Images/21.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Сталин умер от обширного геморрагического инсульта, усугубленного задержкой помощи.", "action": "scene22"},
      {"rect": [400, 580, 300, 100], "text": "Вы вмешиваетесь, чтобы спасти Сталина, вовремя вызываете врача и предотвращаете обширное кровоизлияние в мозг.", "action": "scene80"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene22": {
    "title": "Мандат Никиты Хрущева",
    "text": "Сталину удалось быстро провести индустриализацию СССР и превратить его в сверхдержаву, а также добиться победы над нацистской Германией во Второй мировой войне. Однако его режим укрепился как тоталитарная диктатура, характеризующаяся массовыми репрессиями, включая политические чистки, лагеря принудительного труда (ГУЛАГ) и абсолютный контроль над обществом.\n После смерти Сталина в 1953 году началась борьба за власть. В итоге победителем стал Никита Хрущев, которому удалось укрепить свое положение в 1955 году после политического устранения Лаврентия Берии (казненного в 1953 году) и смещения Георгия Маленкова. Хрущев способствовал процессу десталинизации: он положил конец массовому террору, способствовал проведению амнистий, частично закрыл систему ГУЛАГа и на 20-м съезде КПСС (1956) публично осудил преступления Сталина. Во время его правления был увеличен выпуск потребительских товаров и начался короткий период разрядки с Западом в условиях холодной войны.\n Однако его правительство также столкнулось с сильной напряженностью внутри социалистического блока, например, с восстаниями в Венгрии и Польше в 1956 году. Кроме того, произошел разрыв с Китаем, лидер которого Мао Цзэдун обвинил Хрущева в «ревизионизме». Внутри страны Хрущев провел сельскохозяйственные реформы, направленные на модернизацию села, хотя и с ограниченными результатами.",
    "image_path": "Final-Project_1/Images/22.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Хрущев хотел обогнать США в производстве сельскохозяйственной продукции", "action": "scene23"},
      {"rect": [400, 580, 300, 100], "text": "Вместо того, чтобы начать публичную атаку на наследие Сталина на XX Съезде, Хрущев продвигает “постепенный переход”, сохраняя нейтральный подход к культу личности и одновременно предлагая стратегический союз с Китаем, признавая обоснованность его революционного опыта", "action": "scene81"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene23": {
    "title": "Конец мандата Никиты Хрущева",
    "text": "Кампания «Девственные земли», начатая в 1954 году с целью резкого увеличения производства зерна в Казахстане и Сибири, привела к эрозии и истощению почв, что привело к острой нехватке зерна и голоду в 1963 году. Не имея возможности удовлетворить свои потребности в продовольствии, СССР был вынужден закупать большие объемы пшеницы в США.\n В то же время, во время октябрьского ракетного кризиса 1962 года, решение об установке ядерных ракет на Кубе было призвано укрепить советский престиж по отношению к США и компенсировать стратегическое превосходство НАТО. Разрешение этого кризиса, воспринятое как поражение Хрущева по отношению к Джону Ф. Кеннеди, подорвало его имидж непогрешимого лидера и усилило недовольство внутри страны. Сочетание экономических катастроф и, казалось бы, импульсивных политических решений привело к расколу поддержки. Наконец, в октябре 1964 года Хрущев был отстранен от власти своими же товарищами.",
    "image_path": "Final-Project_1/Images/23.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Приход Михаила Горбачева для спасения режима путем срочного обновления (перестройка и гласность), направленного на внедрение рыночных элементов, прозрачности и политической либерализации.", "action": "scene24"},
      {"rect": [400, 580, 300, 100], "text": "Вместо масштабной и поспешной кампании на целинных землях, Хрущёв в 1954 году принимает совет научного сообщества: инвестировать в интенсификацию сельского хозяйства в существующих зонах, развивая удобрения, мелиорацию и механизацию. Кроме того, во время Карибского кризиса 1962 года он не размещает ядерные ракеты на Кубе, а выбирает стратегию ядерного давления через демонстрационные учения и дипломатические ультиматумы.", "action": "scene82"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene24": {
    "title": "Крупная политическая неудача",
    "text": "Политика открытости и реструктуризации привела к быстрой делегитимации коммунистической партии, а экономика страдала от гиперинфляции и дефицита. На международном уровне окончание холодной войны было закреплено соглашениями о разоружении и выводом войск из Афганистана, а также способствовало падению коммунистических режимов в Восточной Европе (1989). Внутри страны советские республики воспользовались возможностью восстановить свой суверенитет, а неудавшийся путч в августе 1991 года ускорил ослабление Горбачева по отношению к Борису Ельцину.",
    "image_path": "Final-Project_1/Images/24.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Поддержите решение Ельцина подписать Белавежские соглашения вместе с лидерами Украины (Леонид Кравчук) и Беларуси (Станислав Шушкевич). Для того чтобы однозначно поддержать создание независимой Российской Федерации.", "action": "scene25"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene25": {
    "title": "Конец Советского Союза",
    "text": "Официальный конец СССР (25 декабря 1991 года): В конце декабря 1991 года, после подписания Белавежских соглашений, Михаил Горбачев ушел в отставку с поста президента Советского Союза, положив конец существованию советского государства. Быстрый переход от плановой экономической системы к частично либерализованной рыночной системе вызвал сильную гиперинфляцию, резкий рост безработицы и резкое снижение уровня жизни населения.\n Под руководством Бориса Ельцина вся власть была сосредоточена в Москве, были заложены основы нового российского государства, а старая Коммунистическая партия была распущена, уступив место многочисленным политическим формированиям.",
    "image_path": "Final-Project_1/Images/25.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene26": {
    "title": "Город Патаноса",
    "text": "Победа России над Швецией. Однако замерзшая земля помешает рыть фундамент. Речной транспорт (жизненно необходимый для доставки материалов) был бы заблокирован льдом.ПСмертность рабочих была ужасной из-за переохлаждения, голода и болезней. Фундамент крепости Святого Петра и Павла был бы ненадежным.оВойска окопались бы в захваченном Нюншанце и ждали весны 1704 года, чтобы основать Санкт-Петербург из-за возможного зимнего контрнаступления.",
    "image_path": "Final-Project_1/Images/26.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "повлиять на Петра, чтобы он построил островную крепость для защиты входа в Неву. А также построить на острове корабли для защиты Балтики.", "action": "scene27"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene27": {
    "title": "Преждевременная смерть Петра Великого ",
    "text": "В 1704 г. Петр Великий мертв! Строительство было немедленно прекращено. Рабочие (и без того сократившиеся) разбежались или были переведены на другую работу. Двор и дворянство требовали возвращения в Москву, считая проект «дорогостоящей глупостью». Нюншанц вновь станет пограничным форпостом. После смерти Петра его стали называть Петром на болоте.",
    "image_path": "Final-Project_1/Images/27.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Continue", "action": "scene28"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene28": {
    "title": "Конец ",
    "text": "В 2000 Не было бы Петербурга, он был бы забытым регионом.",
    "image_path": "Final-Project_1/Images/28.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene29": {
    "title": "Операция «Барбаросса»",
    "text": "В конце ноября 1941 года немецкие войска занимают столицу. Сталин и правительство переезжают в Куйбышев (Самару), но моральные последствия оказываются катастрофическими. Группа армий «Север» перенаправляет части в Москву для усиления блокады Ленинграда, и в январе 1943 года город падает. Восемьдесят пять процентов славянского населения было истреблено или обращено в рабство. Вскоре после этого город переименовывают в «Ингерманландию».\n Нацисты захватывают Кавказ, где находились запасы нефти (90%).",
    "image_path": "Final-Project_1/Images/29.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Армия Вермахта продвигается на Ближний Восток.", "action": "scene30"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene30": {
    "title": "Падение Советского Союза",
    "text": "Оказавшись загнанной в угол немцами на обоих фронтах, Япония в августе 1942 года врывается на российский Дальний Восток, пользуясь случаем, чтобы напасть и на Советский Союз. Она захватывает Владивосток, закрывая последний советский порт на Тихом океане. В 1943 году Сталин был схвачен и казнен в Берлине.",
    "image_path": "Final-Project_1/Images/30.jpg",
    "buttons": [

      {"rect": [400, 580, 200, 50], "text": "Гитлер запасается советскими ресурсами для вторжения в Европу", "action": "scene31"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene31": {
    "title": "Экспансия нацизма",
    "text": "Германия распространяет свое господство от Франции до Урала. Великобритания соглашается на унизительный мир, уступая требованиям Гитлера сдать Гибралтар и Мальту. Япония устанавливает свой контроль над Китаем, Индией и Океанией. В 1946 году США подписывают перемирие, сбросив атомные бомбы на Хиросиму и Нагасаки, но не добившись полной капитуляции Японии, которая закрепилась на азиатском материке.\n С этого момента США заняли изоляционистскую позицию и превратили доктрину Монро в оборонительную стратегию. Латинская Америка тем временем попала под влияние нацистов, особенно Аргентина и Бразилия.",
    "image_path": "Final-Project_1/Images/31.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Попытка достичь соглашения", "action": "scene32"},
      {"rect": [400, 580, 600, 50], "text": "Борьба до победного конца", "action": "scene33"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene32": {
    "title": "Третья мировая война. ",
    "text": "С Гитлером было достигнуто соглашение, однако семь лет спустя, в 1953, усилив свои войска - война с Советским Союзом истощила их ряды, - он развязал третью мировую войну. С Японией в качестве союзника ему пришлось атаковать только на одном европейском фронте. С падением Европы пали и Соединенные Штаты. Имея достаточно времени, они сумели придумать, как сделать ядерное оружие, и одним махом уничтожили США и Японию, чтобы, по словам Гитлера, «очистить» мир.\n В последующие годы он уничтожил большую часть населения Латинской Америки, Китая, Австралии и других стран мира. Миром стал править нацистский режим.",
    "image_path": "Final-Project_1/Images/32.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene33": {
    "title": "Дорогая победа",
    "text": "Благодаря применению США, в 1946, ядерного оружия против эффективных точек и с помощью армии союзников Гитлер был побежден, но потери были настолько велики, что армии практически не осталось. Из-за распространения нацистов на Россию, землю и чрезмерного применения ядерного оружия, необходимого для победы над нацистами, ядерная зима сделала жизнь в Европе практически невозможной.",
    "image_path": "Final-Project_1/Images/33.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene34": {
    "title": "Победа Карла XII",
    "text": "Карл XII Шведский не упустил возможности. После вторжения в Россию в 1708 году, вместо того чтобы идти в Украину, он направил свои войска на север, чтобы взять Санкт-Петербург. Не имея Кронштадта и действующего флота, шведы легко блокировали бы Неву. Город, который еще только строился и имел слабую сухопутную оборону, пал бы в течение нескольких недель.",
    "image_path": "Final-Project_1/Images/34.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Continue", "action": "scene35"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene35": {
    "title": "Забытое место",
    "text": "В 200, Этот регион остается резервным портом, а из-за климата и болезней на карте образовалась пустая область.",
    "image_path": "Final-Project_1/Images/35.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene36": {
    "title": "Увольнение Сталина",
    "text": "Ленин не доверял Сталину. В своем «Политическом завещании» 1922 года он назвал его «чрезмерно грубым» и призвал сместить его с поста генерального секретаря. Более того, Ленин поддерживал НЭП (сочетание контролируемого капитализма и мелких частных предприятий) как прагматичную меру по восстановлению экономики после гражданской войны. Таким образом, Советский Союз был бы менее индустриализованным, но более стабильным и без сталинского террора.",
    "image_path": "Final-Project_1/Images/36.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Вторая мировая война только началась, и вы советуете Ленину защищаться от идей нацизма.", "action": "scene37"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene37": {
    "title": "Союз против наступления нацизма",
    "text": "В 1938 Нацистско-советский пакт не будет подписан: Ленин и Троцкий рассматривали фашизм как «главного врага» (а не как временного союзника, как это делал Сталин). СССР стремился бы к союзу с демократическими державами: он искал бы соглашения с Францией и Великобританией, чтобы противостоять Гитлеру.",
    "image_path": "Final-Project_1/Images/37.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Поддержка Германии с востока в поддержку Польши, что привело к войне на два фронта для Гитлера с 1939 года.", "action": "scene38"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene38": {
    "title": "Начало II мировой войны",
    "text": "В 1939 СССР надавил бы на восток, заставив Германию сражаться с первого дня, но из-за недостатка промышленного потенциала немцы постепенно победили Советы и захватили часть территории",
    "image_path": "Final-Project_1/Images/38.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Продолжать борьбу с нацистами, отказаться от заключения договора", "action": "scene39"},
      {"rect": [400, 580, 200, 50], "text": "Вы видите, что ситуация не очень хорошая и реальнее всего заключить перемирие.", "action": "scene42"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene39": {
    "title": "Немецкое наступление",
    "text": "В 1940 Из-за отсутствия промышленного производства фронт боевых действий не представлял проблем, поэтому они были на грани достижения Москвы.",
    "image_path": "Final-Project_1/Images/39.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Обращение за помощью к союзникам", "action": "scene40"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene40": {
    "title": "Падение Ленинграда",
    "text": "Это оказывается бесполезным, так как у них нет средств для отражения ожидаемой операции «Барбаросса» (май 1941 года). Гитлер начинает тотальное вторжение в СССР на год раньше запланированного срока, ставя перед собой более амбициозные цели: дойти до Урала к 1942 году. Он добивается беспрецедентного прорыва: не сумев мобилизовать сибирские резервы и захватив заводы, Москва падает в августе 1941 года.\n После этого Германия создает Рейхскомиссариат Московии, эксплуатирует ресурсы и обращает население в рабство.",
    "image_path": "Final-Project_1/Images/40.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "Continue", "action": "scene41"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene41": {
    "title": "Немецкое наступление",
    "text": "В 1941 Город был переименован в «Ингерманландию» и стал нацистским административным центром восточных территорий. Славянское население уничтожалось или обращалось в рабство (Генеральный план «Ост»). Эрмитаж разграблен, церкви превращены в конюшни, памятники Петру I снесены.",
    "image_path": "Final-Project_1/Images/41.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene42": {
    "title": "Новая операция",
    "text": "В 1941 Однако Гитлер понимал, что промышленный потенциал России слишком низок и что она не способна вести тотальную войну. Он начинает операцию «Рыжая борода».",
    "image_path": "Final-Project_1/Images/42.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Continue", "action": "scene43"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene43": {
    "title": "Захват Советского Союза",
    "text": "Он ставит перед собой более амбициозные цели: дойти до Урала к 1942 году. Он добивается беспрецедентного прорыва: не сумев мобилизовать сибирские резервы и захватить заводы, Москва падает в августе 1941 года. Германия создает Рейхскомиссариат Московии, эксплуатирует ресурсы и делает из населения рабов.",
    "image_path": "Final-Project_1/Images/43.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene44": {
    "title": "Немецкое наступление",
    "text": "Петр I окончательно утверждает Кунсткамеру (первый научный музей), Академию наук (основана в 1724 году) и Адмиралтейство в качестве инновационных центров. Привлекает европейских ученых Санкт-Петербург становится крупнейшим технологическим центром Европы, лидером в области навигации, астрономии и инженерного дела.",
    "image_path": "Final-Project_1/Images/44.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Вы подталкиваете его к проведению передовой военной и военно-морской реформы.", "action": "scene45"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene45": {
    "title": "Немецкое наступление",
    "text": "В 1725 Внедрение стандартных кремневых орудий, мобильной артиллерии и 90-пушечных линейных кораблей. Основана Императорская военно-морская академия с навигационными тренажерами. Русский флот доминирует на Балтике и проецирует силу на Средиземноморье, побеждая османов и шведов с помощью превосходной тактики.",
    "image_path": "Final-Project_1/Images/45.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Вы обучаете их английским технологиям выплавки стали, чтобы добиться ускоренной индустриализации, используя уральское железо для создания комплексов с доменными печами на коксе.", "action": "scene46"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene46": {
    "title": "Немецкое наступление",
    "text": "В 1730 Россия становится крупнейшим в Европе производителем стали, экспортирует корабли, пушки и текстильные машины; в то же время она захватывает Стокгольм после военно-морской кампании на Балтике, присоединяет Финляндию и утверждается в Скандинавии.",
    "image_path": "Final-Project_1/Images/46.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Петр не доверял своей традиционной семье.Петр I «Великий» дожил примерно до 1745 года и укрепил Россию в качестве ведущей промышленной и военной державы Европы. На смертном одре он назначил своим преемником Ивана Бецкого (1704-1795), своего внебрачного сына от шведской дворянки Анны Монс, потому что Бецкой учился в Париже и овладел как инженерным делом, так и искусством. Но прежде всего за его дальновидность, ведь он основал Смольный институт для женщин и способствовал созданию технических школ", "action": "scene47"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene47": {
    "title": "Немецкое наступление",
    "text": "В 1750 Технократический переход и промышленная консолидация",
    "image_path": "Final-Project_1/Images/47.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Англия попытается вторгнуться в Прибалтику", "action": "scene48"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene48": {
    "title": "Немецкое наступление",
    "text": "В 1780 Флот паровых линкоров (спроектированных Бецкой) должен был сдерживать атаки.",
    "image_path": "Final-Project_1/Images/48.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Смерть Ивана Бецкого (1795) - преемника-технократа, назначенного Петром Великим", "action": "scene49"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene49": {
    "title": "Немецкое наступление",
    "text": "В 1799 Россия становится крупнейшим в Европе производителем стали, экспортирует корабли, пушки и текстильные машины; в то же время она захватывает Стокгольм после военно-морской кампании на Балтике, присоединяет Финляндию и утверждается в Скандинавии.",
    "image_path": "Final-Project_1/Images/49.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Во время своего правления он развивал инфраструктуру: завершил строительство системы каналов в Санкт-Петербурге, основал Императорский политехнический университет и построил железную дорогу Москва - Санкт-Петербург с сибирскими стальными рельсами. Он заключил союз с Пруссией, изолировавший Францию и Австрию, и без войны присоединил Галицию (Польшу). После его смерти власть перешла к Железному совету, состоящему из пяти членов: Директор Академии наукоАдмирал Балтийского флота.Уральский мастер (главный промышленник).Гетман Украины (гарант сельского хозяйства).Московский митрополит", "action": "scene50"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene50": {
    "title": "Немецкое наступление",
    "text": "Благодаря Совету в 1800 году была создана Императорская электрическая сеть, обеспечившая уличное освещение в Санкт-Петербурге и Москве. В 1812 году Россия получила иммунитет против Наполеона: «Великая Отечественная война» длилась шесть месяцев, и русские паровые танки разгромили Великую армию под Смоленском. Россия становится крупнейшим в Европе производителем стали, экспортирует корабли, пушки и текстильн",
    "image_path": "Final-Project_1/Images/50.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Евразийский пакт (Россия-Пруссия-Китай) для сдерживания конфликта", "action": "scene51"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]

  },
    "scene51": {
    "title": "Немецкое наступление",
    "text": "В 1830 Россия становится крупнейшим в Европе производителем стали, экспортирует корабли, пушки и текстильные машины; в то же время она захватывает Стокгольм после военно-морской кампании на Балтике, присоединяет Финляндию и утверждается в Скандинавии.",
    "image_path": "Final-Project_1/Images/51.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "После победы в Балтийской кампании Россия не аннексирует Финляндию полностью и не захватывает Стокгольм, а заключает выгодный мирный договор со Швецией в 1875 году, создав Северный Союз — экономико-военно-политический блок с центром в Петербурге. Вместо оккупации — протекторат и взаимовыгодное сотрудничество.", "action": "scene52"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene52": {
    "title": "Немецкое наступ",
    "text": "Уже в 1880 году начался совместный промышленный бум: российско-скандинавские консорциумы начали стремительное расширение сталелитейных заводов, верфей и текстильных фабрик.Санкт-Петербург и Стокгольм становятся центрами инноваций и культуры, где проходят ",
    "image_path": "Final-Project_1/Images/82.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene53"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene53": {
    "title": "Немецкое наступ",
    "text": "В 1914 году Россия объявляет нейтралитет в Великой войне, ограничиваясь поставками оружия своим бывшим союзникам, и избегает внутреннего коллапса и огромных военных потерь.",
    "image_path": "Final-Project_1/Images/53.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene54": {
    "title": "Немецкое наступ",
    "text": " В 1708 Меншиков терпит неудачу во внезапном нападении, и, объединив 5000 казачьих улан, Карл XII планирует и устраивает засаду в Зерновке, которая уничтожает русские подкрепления и захватывает орудия, повышая боевой дух его войск. Благодаря тому, что Киев был закреплен под протекционистским просоветским правительством, а Мазепа признан гетманом, Швеция сохранила стабильное материально-техническое убежище на юге, предотвратила Полтавский разгром и в конечном итоге вынудила Петра I вести переговоры на гораздо более выгодных условиях.",
    "image_path": "Final-Project_1/Images/54.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene55"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene55": {
    "title": "Немецкое наступ",
    "text": "Столкнувшись с невозможностью вернуть Украину без значительных потерь, царь был вынужден в 1710 году начать мирные переговоры. Белоцерковский договор де-факто признает шведскую сферу влияния на казачью Украину и обязывает Россию временно уступить приграничные территории и выплатить военные компенсации. Благодаря тому, что Балтийские пути свободны от российских угроз, Швеция укрепляет свои позиции в Ливонии и Эстонии, укрепляет Черное море как защищенный торговый коридор и укрепляет систему местных законов, предоставляющих гетманам широкую автономию.",
    "image_path": "Final-Project_1/Images/55.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene56"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene56": {
    "title": "Немецкое наступ",
    "text": "В 1711 Мазепа, возведенный в ранг принца-протектора, учреждает представительный казачий совет, который закладывает основы двуязычной украинской идентичности —шведско-русофильской— которая просуществует до революции 1917 года.",
    "image_path": "Final-Project_1/Images/56.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene57"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene57": {
    "title": "Немецкое наступ",
    "text": "Престиж Карла XII растет по всей Европе: его молниеносная победа разжигает антироссийский союз Саксонии и Олимпии, и Пруссия, опасаясь шведской власти, присоединяется к коалиции, не позволяя России вскоре вернуть себе прежний статус. Таким образом, Великая северная война завершилась в 1712 году нордико-дунайским балансом, который на десятилетия задержал окончательное становление России как великой континентальной державы.",
    "image_path": "Final-Project_1/Images/57.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene58": {
    "title": "Немецкое наступ",
    "text": "Из-за нехватки персонала строительство не было завершено в желаемое время, город находится на грани вторжения, поскольку это идеальное место из-за небольшого количества укреплений",
    "image_path": "Final-Project_1/Images/58.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene59": {
    "title": "Немецкое наступ",
    "text": "Интенсивная артиллерийская дуэль выводит из строя большую часть русских частей, прежде чем они откроют огонь в упор; в то же время шведская кавалерия атакует фланги русских войск, дезорганизуя их оборону и вынуждая Петра I перегруппировать свои резервы. Из-за беспорядка в орудиях и нехватки боеприпасов имперской армии не удается уничтожить шведов на равнине, и после четырех часов нерешительного боя она в конечном итоге отступает на укрепленные позиции.",
    "image_path": "Final-Project_1/Images/59.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene60"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene60": {
    "title": "Немецкое наступ",
    "text": "Интенсивная артиллерийская дуэль выводит из строя большую часть русских частей, прежде чем они откроют огонь в упор; в то же время шведская кавалерия атакует фланги русских войск, дезорганизуя их оборону и вынуждая Петра I перегруппировать свои резервы. Из-за беспорядка в орудиях и нехватки боеприпасов имперской армии не удается уничтожить шведов на равнине, и после четырех часов нерешительного боя она в конечном итоге отступает на укрепленные позиции.",
    "image_path": "Final-Project_1/Images/60.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene61": {
    "title": "Немецкое наступ",
    "text": "Пользуясь налоговыми льготами и официальным покровительством, купцы и ремесленники массово расселяются по Петербургу, заполняя недавно украшенные улицы мастерскими, академиями и дворцами. Новый Городской совет, состоящий из бюргеров, ученых и офицеров гвардии— издает постановления, которые устанавливают благоустроенные проспекты, финансируют строительство большого театра Фортуны и организуют международные рынки в порту. Московские дворяне, видя себя не в выгоде от эдикта, теряют влияние при дворе и в 1727 году предпринимают робкую попытку государственного переворота, прерванную Меншиковым и Преображенской гвардией.",
    "image_path": "Final-Project_1/Images/61.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene62"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene62": {
    "title": "Немецкое наступ",
    "text": "Укрепляя процветание и культурный престиж, Санкт-Петербург привлекает посольства со всей Европы, укрепляет свой флот на Балтике и выпускает первую национальную газету. К 1730 году любое предложение о возвращении столицы Москве лишилось политической и социальной поддержки, поскольку “зарождающийся” город стал настоящим политическим, экономическим и культурным сердцем Российской империи",
    "image_path": "Final-Project_1/Images/62.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene63": {
    "title": "Немецкое наступ",
    "text": "После того, как Петр III был изгнан, а не убит, Екатерина избегает клейма внутреннего цареубийства и укрепляет свою легитимность в глазах европейских дворов, которые отмечают “гуманитарный жест” и приближают ее к модели просвещенной монархии. Без политического мученика Меншиков и Орловы теряют часть своего влияния, поскольку не могут выступать в роли линчевателей, а новая императрица проводит свои реформы с меньшим преследованием фракций: Зимний дворец и Эрмитаж становятся символами не только величия, но и современности. и Смольный институт, свободный от ограничений. вызывающий подозрения, он привлекает студенток со всех провинций.",
    "image_path": "Final-Project_1/Images/63.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene64"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene64": {
    "title": "Немецкое наступ",
    "text": "Пруссия, благодарная за то, что приняла свергнутого государя, укрепляет торговые связи с Россией, что удешевляет импорт железа и тканей и финансирует благоустройство Санкт-Петербурга. Не числя себя в числе погибших, Петр III также становится потенциальным международным посредником: его дядя Фридрих II служит связующим звеном в заключении договора о ненападении между Россией и Пруссией в 1764 году, который обеспечивает спокойствие на границе и позволяет Екатерине сосредоточиться на экспансии на Кавказ и реформа судебной системы, не опасаясь нападения. ни внутренний государственный переворот, ни военное вмешательство против собственного супруга.",
    "image_path": "Final-Project_1/Images/64.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene65": {
    "title": "Немецкое наступ",
    "text": "Придя к власти вместе в 1796 году, Павел и Александр немедленно приступили к проведению правовых и образовательных реформ, о которых мечтала Екатерина: Сенат был реорганизован в специализированные комиссии, в провинциях была введена светская школьная система, а уголовный кодекс был пересмотрен.отменить пытки и произвольные смертные приговоры.\n Присутствие Павла в качестве старшего монарха обеспечивает авторитарную стабильность, в то время как Александр возглавляет культурную модернизацию и европейскую дипломатию, обеспечивая союз с Великобританией перед лицом французских революционных амбиций.",
    "image_path": "Final-Project_1/Images/65.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene66"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene66": {
    "title": "Немецкое наступ",
    "text": "Совместное регентство также укрепляет престиж династии и предотвращает придворные интриги: консервативная знать, столкнувшись с примером активного и популярного наследного принца, теряет влияние перед лицом нового корпуса меритократических чиновников.\n После смерти Павла в 1801 году Александр унаследовал империю, которая уже была преобразована более чем за пять лет четкой просвещенной ориентации, что позволило ему взглянуть в будущее России с более централизованным государством, эффективной администрацией и профессиональная армия, которая определит положение Империи в наполеоновских войнах.",
    "image_path": "Final-Project_1/Images/66.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene67": {
    "title": "Немецкое наступ",
    "text": "Предложение о диалоге и объявление Устава успокаивают интригу: некоторые из заговорщиков, в том числе и Зубов, видят, что их сила давления может принести результаты без кровопролития, и отказываются от своих насильственных планов. Дворянство начинает сотрудничать с новым Советом, восстанавливая гармонию при дворе и укрепляя лояльность трону. Не совершив убийства, Павел укрепляет свой авторитет, сохраняя при этом более умеренный имидж, прокладывая путь для мирного перехода в пользу Александра I, когда придет время, и избегая политической травмы, которая могла бы потрясти Российскую империю.",
    "image_path": "Final-Project_1/Images/67.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene68": {
    "title": "Немецкое наступ",
    "text": "Временное прекращение огня останавливает преследование Русских и позволяет Великой армии восстановиться и пополниться хорошо сопровождаемыми конвоями; тем временем переговоры на нейтральной территории приводят к тому, что Россия признает Рейнскую Конфедерацию и временно уступает контроль над территориями Балтии в обмен на экономические обязательства перед Парижем.",
    "image_path": "Final-Project_1/Images/68.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene69"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene69": {
    "title": "Немецкое наступ",
    "text": "Имея безопасные линии снабжения и отдохнувшую артиллерию, Наполеон избегает большого отступления: наступает зима, когда обе стороны занимают оборонительные позиции, и, столкнувшись с перспективой огромных потерь, они подписали в декабре 1812 года Вильнюсский договор, закрепляющий статус-кво, благоприятный для Франции.без взаимного уничтожения.\n Наполеоновская империя укрепляется морально, сохраняет в неприкосновенности свою Великую армию и сохраняет инициативу в Центральной Европе, в то время как Россия, защищая свою армию и свою территорию, становится жизненно важным партнером в новом континентальном балансе.",
    "image_path": "Final-Project_1/Images/69.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene70": {
    "title": "Немецкое наступ",
    "text": "Собрав просвещенных дворян и офицеров-декабристов в смешанные комиссии внутри Собрания, был быстро заключен Санкт-Петербургский пакт, который постепенно отменял крепостное право в течение десяти лет, учреждал двухпалатный парламент с участием представителей дворянства и провинций и устанавливал ограничения на арбитражную власть царя посредством свода “законов фундаментальные",
    "image_path": "Final-Project_1/Images/70.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene71"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene71": {
    "title": "Немецкое наступ",
    "text": "Участие бывших лидеров декабристов в правительстве снижает его радикализацию и укрепляет легитимность нового режима; помещики получают компенсацию за освобождение своих крепостных, в то время как крестьяне получают прогрессивные гражданские права.\n В атмосфере примирения и контролируемых перемен подпольные движения теряют импульс, цензура умеренно ослабляется, чтобы завоевать расположение общественного мнения, и Россия вступает в этап спокойной модернизации, которая ускоряет индустриализацию и закладывает основу для конституционного государства.без насильственных разрывов, которые могли бы задержать его развитие.",
    "image_path": "Final-Project_1/Images/71.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene72": {
    "title": "Немецкое наступ",
    "text": "В соответствии с этим новым импульсом эмансипация 1856 года была проведена на два года раньше и на более щедрых условиях для крестьян, которым были предоставлены участки с 50% компенсацией и доступ к государственным кредитам; в то же время армия была реорганизована за счет включения меритократических командиров и стандартизированной униформы, и было создано Постоянное консультативное собрание, которое он вводит публичные дебаты по гражданским кодексам и свободе печати.",
    "image_path": "Final-Project_1/Images/72.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene73"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene73": {
    "title": "Немецкое наступ",
    "text": "Ранняя модернизация ускоряет строительство железных дорог и заводов, привлекает иностранный капитал и резко сокращает беспорядки в сельской местности. Когда Николай I умирает в марте 1855 года, он оставляет государство, уже переходящее к ограниченному конституционализму, что открывает Александру II возможность консолидировать реформы без традиционного сопротивления и поставить Россию на один уровень с великими европейскими державами намного раньше, чем планировалось.",
    "image_path": "Final-Project_1/Images/73.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene74": {
    "title": "Немецкое наступ",
    "text": "Покушение Игнатия Гриневицкого срывается: не дождавшись царя, он задержан на подступах к Марсову полю. Обнаруженные у него документы раскрывают сеть 'Народной воли', и репрессии проходят быстро, но на фоне уже начатых реформ — с гораздо меньшим общественным сочувствием к радикалам.\n В апреле 1881 года Александр II торжественно провозглашает 'Основной закон Российской державы', который учреждает выборные земские представители в расширенном Государственном совете. Общество, измученное кровопролитием и напряжением, встречает реформу с осторожным энтузиазмом.",
    "image_path": "Final-Project_1/Images/74.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene75"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene75": {
    "title": "Немецкое наступ",
    "text": "Реформы, начатые при его жизни, теперь получают институциональную опору: усиливаются суды присяжных, вводится независимость прессы, укрепляется реформа образования. Его сын, Александр III, вступает на престол уже не как “император-мститель”, а как гарант умеренного перехода к модернизации.",
    "image_path": "Final-Project_1/Images/75.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene76"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene76": {
    "title": "Немецкое наступ",
    "text": "Вместо Храма Спаса-на-Крови на месте покушения воздвигается Памятник Примирения и Закона, символизирующий победу реформ над террором. Россия в этом сценарии вступает в XX век не с революциями и самодержавием, а как конституционная империя, способная эволюционировать, а не взрываться.",
    "image_path": "Final-Project_1/Images/76.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
    "scene77": {
    "title": "Немецкое наступ",
    "text": "Россия сохраняет внутреннюю стабильность и избегает колоссальных потерь на фронтах. Продовольственный кризис, инфляция и транспортный коллапс не достигают разрушительных масштабов, как в реальной истории. В отсутствие военного поражения позиции царской власти остаются сильнее, а умеренные либеральные силы получают шанс на реальные реформы через Государственную думу.",
    "image_path": "Final-Project_1/Images/77.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene78"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene78": {
    "title": "Немецкое наступ",
    "text": "К 1917 году Россия переживает экономический подъем: экспорт зерна растет, иностранные инвестиции в промышленность увеличиваются, а аграрная реформа Столыпина продолжается. Революционные настроения в рабочих кругах уменьшаются на фоне улучшения условий труда и сокращения репрессий. Социал-демократические и большевистские организации маргинализированы.",
    "image_path": "Final-Project_1/Images/78.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene79"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene79": {
    "title": "Немецкое наступ",
    "text": "К 1920-м Россия вступает как конституционная монархия, с реальной законодательной властью парламента, мощным аграрным сектором и растущими городами. Вместо революции — эволюция. Большевики остаются в эмиграции, а Ленин — малоизвестным публицистом в Цюрихе.",
    "image_path": "Final-Project_1/Images/79.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene80": {
    "title": "Немецкое наступ",
    "text": "Оказавшись загнанной в угол немцами на обоих фронтах, Япония в августе 1942 года врывается на российский Дальний Восток, пользуясь случаем, чтобы напасть и на Советский Союз. Она захватывает Владивосток, закрывая последний советский порт на Тихом океане. В 1943 году Сталин был схвачен и казнен в Берлине.",
    "image_path": "Final-Project_1/Images/80.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene81": {
    "title": "Немецкое наступ",
    "text": "Избегая радикального разрыва с прошлым, КПСС сохраняет внутреннюю сплоченность, и Берия едва возвращается на сцену, в то время как новая линия примирения укрепляет связи с Пекином: сельскохозяйственные реформы проводятся с китайской консультацией, в результате чего урожаи кукурузы превышают запланированные; идеологическая солидарность препятствует восстановлению отношений с Пекином. китайско-советский раскол и ослабляет напряженность в Венгрии и Польше, где Кремль предпочитает контролируемые политические уступки, а не военное вмешательство; блокада Берлина превращается в дипломатические переговоры с Западом, ускоряющие деэскалацию после начала холодной войны; а совместный толчок к космической программе утроил количество успешных запусков до 1960 года.\n Внутренне, дозируя открытия —широкие амнистии, но не давая свободы многопартийности— - режим снижает уровень страха, повышает уровень жизни за счет бума потребительских товаров и сохраняет коммунистическую структуру власти нетронутой, обеспечивая более стабильное и сплоченное руководство до начала 1970-х годов.",
    "image_path": "Final-Project_1/Images/81.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Mneu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene82": {
    "title": "Немецкое наступ",
    "text": "Интенсификация аграрной сферы даёт устойчивые урожаи без деградации почв. К 1963 году зерна достаточно для внутреннего потребления и экспорта в страны СЭВ. Повышение продовольственной безопасности укрепляет поддержку сельского населения и снижает зависимость от США. Внешнеполитическая стратегия Хрущёва воспринимается как прагматичная и зрелая: он демонстрирует силу, не ставя мир на грань ядерной войны.\n Его имидж внутри страны усиливается — он выглядит как реформатор, избегающий катастроф, а не провоцирующий их.",
    "image_path": "Final-Project_1/Images/82.jpg",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Следующий", "action": "scene83"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene83": {
    "title": "Немецкое наступ",
    "text": "К 1964 году экономика демонстрирует рост, политические риски минимальны, а международный престиж СССР выше. Вместо смещения, Хрущёв добровольно передаёт власть в 1967 году, завершив своё правление как реформатор, избежавший как голода, так и ядерного конфликта. Его преемник получает более устойчивую систему, где десталинизация сочетается с экономическим pragматизмом и дипломатической гибкостью.",
    "image_path": "Final-Project_1/Images/83.jpg",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
    },
    "scene101": {
    "title": "1700: Приказ об обследовании Невы",
    "text": "1700: Приказ об обследовании Невы Столкнувшись с перспективой расширения своей территории и получения доступа к Балтийскому морю, царь Петр Великий приказал провести обследование болот вдоль реки Невы.\n Целью было определить стратегическое место для строительства крепости, а позднее и современного города — ворот России к морю.",
    "image_path": "Final-Project_1/Images/101.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Королевским инженерам", "action": "scene102"},
      {"rect": [700, 580, 200, 50], "text": "Отправьте местную милицию", "action": "scene114"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene102": {
    "title": "1703: Закладка фундамента Санкт-Петербурга",
    "text": "1703: Закладка фундамента Санкт-Петербурга. После трех лет изысканий и подготовки, 27 мая 1703 года царь Петр Великий официально приказал построить крепость, названную Петропавловской крепостью, на Заячьем острове, посреди реки Невы.\n Это считается первым кирпичом, закладывающим фундамент нового города - Санкт-Петербурга. Началось строительство крепости.",
    "image_path": "Final-Project_1/Images/102.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Устойчивое каменное литье Сильная крепость.", "action": "scene103"},
      {"rect": [700, 580, 200, 50], "text": "Быстрое деревянное строительство, быстрое завершение проекта", "action": "scene126"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene103": {
    "title": "1712: Столица перенесена в Санкт-Петербург",
    "text": "1712: Столица перенесена в Санкт-Петербург. После почти десятилетия строительства и укрепления стратегического положения \n на берегах реки Невы царь Петр Великий официально объявил о переносе столицы Российской империи из Москвы — традиционного центра России — в новый город Санкт-Петербург.",
    "image_path": "Final-Project_1/Images/103.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Торжественное шествие повышает престиж", "action": "scene104"},
      {"rect": [400, 580, 200, 50], "text": "Двигайтесь бесшумно. Сократите расходы.", "action": "scene104"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene104": {
    "title": "1750 год: Расширение внутреннего города",
    "text": "1750 год: Расширение внутреннего города. К середине XVIII века Санкт-Петербург уже превратился в значимый административный и культурный центр Российской империи.\n В 1750 году начинается активное расширение внутреннего города: строятся новые улицы, каналы, мосты и жилые кварталы.",
    "image_path": "Final-Project_1/Images/104.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Построить прямой канал для быстрой транспортировки", "action": "scene105"},
      {"rect": [700, 580, 200, 50], "text": "Развитие промышленности", "action": "scene107"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene105": {
    "title": "1812: Наполеоновские войны – опасность у ворот",
    "text": "1812: Наполеоновские войны – опасность у ворот. Вторжение Наполеона Бонапарта в Россию в 1812 году вызвало шок по всей империи.\n Хотя военное внимание было сосредоточено на Москве и Смоленске, Санкт-Петербург – столица империи – также подвергался риску нападения.",
    "image_path": "Final-Project_1/Images/105.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Уничтожение Невского моста замедляет французскую артиллерию", "action": "scene106"},
      {"rect": [700, 580, 200, 50], "text": "Удерживайте мост, чтобы отступить. Люди безопасно эвакуируются.", "action": "scene106"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene106": {
    "title": "1855: Великий пожар — катастрофа в старом деревянном квартале",
    "text": "1855: Великий пожар — катастрофа в старом деревянном квартале. Весной 1855 года в южном жилом районе города, где все еще стояли многие ранние деревянные постройки, вспыхнул крупный пожар.\n Сильный ветер и тесное расположение построек привели к быстрому распространению огня, в результате чего сгорели десятки рядов домов, мастерских и складов.",
    "image_path": "Final-Project_1/Images/106.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Использование воды Невы для тушения пожара", "action": "scene107"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene107": {
    "title": "1860: Индустриализация – первые дымовые столбы",
    "text": "1860: Индустриализация – первые дымовые столбы. Вступая в 1860-е годы,\n под влиянием экономических реформ и необходимости военной модернизации, Санкт-Петербург вступил в период мощной индустриализации.",
    "image_path": "Final-Project_1/Images/107.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Инвестиции в судостроение Развитие портов", "action": "scene108"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene108": {
    "title": "1897: Взрыв населения — население города достигает 2 миллионов жителей",
    "text": "1897: Взрыв населения — население города достигает 2 миллионов жителей. Результаты переписи населения Российской империи 1897 года показали,\n что население Санкт-Петербурга превысило отметку в 2 миллиона, что сделало его вторым по величине городом после Москвы и одним из самых густонаселенных городов Европы того времени.",
    "image_path": "Final-Project_1/Images/108.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Расширение границ города", "action": "scene109"},
      {"rect": [700, 580, 200, 50], "text": "В 1914 году, вместо немедленного вступления в войну после убийства Франца Фердинанда, Николай II принимает предложение министра финансов Коковцова и великого князя Николая Николаевича", "action": "scene77"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene109": {
    "title": "1917: Февральская и Октябрьская революции!",
    "text": "1917: Февральская и Октябрьская революции – падение правительства и возрождение1В 1917 году Петроград стал эпицентром двух революций, потрясших всю Российскую империю.",
    "image_path": "Final-Project_1/Images/109.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Поддержите Советский Союз. Родился парк имени Ленина.", "action": "scene110"},
      
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene110": {
    "title": "1924: Переименование Ленинграда — в честь вождя Ленина",
    "text": "1924: Переименование Ленинграда — в честь вождя Ленина. После того, как в январе 1924 года скончался Владимир Ленин,\n основатель Советского государства, советское правительство решило переименовать бывшую столицу Петроград в Ленинград, чтобы почтить его вклад в революцию и социалистическое строительство.",
    "image_path": "Final-Project_1/Images/scene110.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Открытие «Каменной дороги» через скользкое озеро Батьзыонг зимой", "action": "scene111"},
      
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene111": {
    "title": "1955: Послевоенная реконструкция — возрождение устойчивого города",
    "text": "1955: Послевоенная реконструкция — возрождение устойчивого города. После почти десятилетия разрушений\n во время блокады Ленинграда (1941–1944) город начал период масштабной реконструкции в середине 1950-х годов.1\n Советское правительство сосредоточилось на восстановлении дорожной и мостовой системы, важной инфраструктуры и жилых районов, которые были разрушены или серьезно повреждены. Был предпринят ряд строительных проектов, чтобы вернуть город к нормальной работе, одновременно модернизировав его для удовлетворения потребностей послевоенного экономического роста и роста населения.",
    "image_path": "Final-Project_1/Images/111.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Subway Priority Создайте современный штрих", "action": "scene112"},
      
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene112": {
    "title": "1991–2000: Переходный период – Возвращение в Санкт-Петербург",
    "text": "1991–2000: Переходный период – Возвращение в Санкт-Петербург. После распада Советского Союза в 1991 году Ленинград официально изменил свое название обратно на Санкт-Петербург после референдума.\n Это изменение названия имело не только историческое и культурное значение, но и стало поворотным моментом в переходе от социализма к рыночной экономике и демократическому обществу.",
    "image_path": "Final-Project_1/Images/112.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Содействие культурному туризму", "action": "scene113"},
      
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene113": {
    "title": "Северный Символ",
    "text": "Санкт-Петербург расположен на севере России, на побережье Балтийского моря, и является важными воротами в западный мир.\n Поэтому город часто рассматривается как «символ Севера» для России и всей Северной Европы.",
    "image_path": "Final-Project_1/Images/113.png",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene114": {
    "title": "Развитие традиционных ремесел",
    "text": "1703:Развитие традиционных ремесел в Санкт-ПетербургеРНесмотря на то, что Санкт-Петербург известен как крупный промышленный\n и культурный центр России, он также сохраняет и развивает множество традиционных ремесел, внося свой вклад в обогащение экономической и культурной жизни города.",
    "image_path": "Final-Project_1/Images/114.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Разработка вручную", "action": "scene115"},
      {"rect": [700, 580, 200, 50], "text": "Развитие промышленности", "action": "scene107"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene115": {
    "title": "1791:  Вступление в профсоюзы — расширение международной торговли",
    "text": "1791:  Вступление в профсоюзы — расширение международной торговли. Благодаря своему стратегическому расположению на Балтийском море и роли ворот в Европу,\n Санкт-Петербург вскоре стал важным торговым центром России. Для развития своей экономики и укрепления внешнеторговых связей город активно участвовал в торговых союзах и международных экономических соглашениях.",
    "image_path": "Final-Project_1/Images/115.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Переговоры с Таллином", "action": "scene116"},
      {"rect": [700, 580, 200, 50], "text": "Абсолютная ориентация на экспортную торговлю", "action": "scene121"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene116": {
    "title": "1812: В условиях глобальных политических и экономических потрясений ",
    "text": "Санкт-Петербург сталкивается с серьезными проблемами в городском управлении, перенаселением и конфликтами между развитыми регионами.\n В самом сердце города, вдоль Невского проспекта — экономической и культурной артерии — возникло новое движение, возглавляемое ведущими предпринимателями, художниками и учеными, по созданию самоуправляемой, устойчивой и креативной городской территории: Независимый Невский проспект.",
    "image_path": "Final-Project_1/Images/116.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Независимость правительства", "action": "scene117"},
      {"rect": [700, 580, 200, 50], "text": "Чисто развлекательная урбанизация", "action": "scene120"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene117": {
    "title": "В конце 19-го и начале 20-го веков Санкт-Петербург — тогда индустриальное сердце Российской империи — вступил в период взрывного развития механизации, но позже, чем Англия, Германия или Франция",
    "text": "1899: В конце 19-го и начале 20-го веков Санкт-Петербург — тогда индустриальное сердце Российской империи — вступил в период взрывного развития механизации,\n но позже, чем Англия, Германия или Франция. Этот период называется Поздней промышленной революцией, когда Россия пыталась сократить разрыв с Западом за счет скорости и сильного государственного вмешательства.",
    "image_path": "Final-Project_1/Images/117.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Инвестиции в угольные шахты", "action": "scene118"},
      {"rect": [700, 580, 200, 50], "text": "Развитие промышленности", "action": "scene107"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene118": {
    "title": "1952: Северный портовый город ",
    "text": "1952: Северный портовый город – замерзшие ворота в РоссиюССанкт-Петербург – не только древняя столица,\n но и «северный портовый город», где Балтийское море встречается с душой России. Этот город не замкнутый, как Москва, и не теплый, как Одесса на юге – но холодный,\n величественный и гордый, с ногами, покрытыми льдом и снегом, обращенными к океану.",
    "image_path": "Final-Project_1/Images/118.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Поддерживать малый порт", "action": "scene119"},
      {"rect": [700, 580, 200, 50], "text": "Развитие промышленности", "action": "scene107"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene119": {
    "title": "2000: Медленное развитие исторических городов",
    "text": "2000: Медленное развитие исторических городов. На рубеже тысячелетий Санкт-Петербург столкнулся со сложным вопросом:\n следует ли ему продолжать расширяться и модернизироваться или следует сохранить древнюю красоту,\n составляющую душу города? Исторические города, ставшие свидетелями революций, симфоний и следов тысяч легендарных личностей, замерли в планировании и инвестициях.",
    "image_path": "Final-Project_1/Images/119.png",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene120": {
    "title": "2000: Невский стал «городом вечеринок»",
    "text": "2000: Невский стал «городом вечеринок» — полным баров, пешеходных улиц, потребительских зон... но лишенным производства, технологий, автономии.\nПоследствия: лопнувший пузырь туризма, отсутствие реальной экономики → быстрая рецессия.",
    "image_path": "Final-Project_1/Images/120.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "End game", "action": "end_game"},
      
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene121": {
    "title": "1965 :Ленинградское правительство решило перенести фокус экономического развития",
    "text": "1965 :Ленинградское правительство решило перенести фокус экономического развития с производства на портовые услуги и экспортную торговлю,\n следуя модели «логистического города — ворот в Восточную Европу». Последствия: Отечественные производственные секторы (машиностроение, обрабатывающая промышленность, традиционные ремесла)\n были отрезаны от капитала, чтобы освободить место для портов, таможенных складов и зон внешней торговли. Рабочие фабрик потеряли работу. Люди стали полностью зависеть от потока товаров из Западной и Восточной Европы.",
    "image_path": "Final-Project_1/Images/121.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Подписание соглашения об «Эксклюзивном экспорте» с Балтийским Союзом", "action": "scene122"},
      {"rect": [700, 580, 200, 50], "text": "Создание «Технологического парка Портсайд»", "action": "scene124"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene122": {
    "title": "1979: Чтобы конкурировать с другими балтийскими портами",
    "text": "1979: Чтобы конкурировать с другими балтийскими портами (такими как Рига или Таллин), Ленинград обещал максимально снизить тарифы на транзит и\n экспорт товаров в обмен на получение технической помощи от Балтийского союза. Техническая помощь не пришла вовремя,\n а таможенные пошлины были урезаны, что истощило городской бюджет. Инфраструктура была полусырой, коммерческие проекты были заброшены. Возникла ситуация «висящих портов — воздуха».",
    "image_path": "Final-Project_1/Images/122.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "продолжать", "action": "scene123"},
      
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene123": {
    "title": "2000: Город был «административно распущен»",
    "text": "Международные рынки отступают после распада Советского Союза. Как только Советский Союз распался,\n западные торговые партнеры отказались от ленинградских контрактов, обратившись к более дешевым рынкам, таким как Польша и Китай.\n Вся портовая экономика Санкт-Петербурга рухнула всего за несколько месяцев. 2000: Город был «административно распущен»",
    "image_path": "Final-Project_1/Images/123.png",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene124": {
    "title": "1975: Городское правительство создало «Особую промышленно-инновационную зону «Нева»",
    "text": "1975: Городское правительство создало «Особую промышленно-инновационную зону «Нева» рядом с портом, которая включает:\nМорской технологический парк, завод автоматизации и центр механических и электронных исследований. Академия наук сотрудничает с западными партнерами в разработке промышленных роботов,\n проектирования рефрижераторных судов и океанографических технологий. Город стал «морской технологической столицей» Восточной Европы.",
    "image_path": "Final-Project_1/Images/124.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "продолжать", "action": "scene125"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene125": {
    "title": "1989 – Смягчение постсоветского перехода с помощью политики «культурно-экономического самоуправления»",
    "text": "1989 – Смягчение постсоветского перехода с помощью политики «культурно-экономического самоуправления» Незадолго до распада Советского Союза город запустил модель «автономного городского управления»,\n не дожидаясь центрального правительства: местные фонды развития были мобилизованы из отечественных и иностранных инжиниринговых корпораций. Сохранение исторических городских территорий для развития высококачественного туризма.\n Когда другие города впали в кризис, Санкт-Петербург привлек иностранные инвестиции и сохранил стабильный административный аппарат.🌟 2000 – Город сияет",
    "image_path": "Final-Project_1/Images/125.png",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene126": {
    "title": " 1720–1760 – Городской бум и… пожары",
    "text": " 1720–1760 – Городской бум и… пожары Строительство из дерева продолжалось, потому что это было быстро и дешево.\n Однако город пережил несколько крупных пожаров, каждый раз перестраиваясь, но так и не перейдя на камень. Это создало стиль «постоянной импровизации» — живой, но хрупкой.",
    "image_path": "Final-Project_1/Images/126.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "Использование воды Невы для тушения пожара", "action": "scene107"},
      {"rect": [700, 580, 200, 50], "text": "Усилия по окаменению", "action": "scene127"},
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene127": {
    "title": "1770 – Неудачная попытка окаменения",
    "text": "1770 – Неудачная попытка окаменения. Екатерина II пытается построить из камня, чтобы придать империи постоянную идентичность,\n но терпит неудачу из-за огромных затрат и реакции населения, привыкшего к деревянной архитектуре. Санкт-Петербург становится легкой столицей – полной искусства, но без длительного политического веса.",
    "image_path": "Final-Project_1/Images/127.png",
    "buttons": [
      {"rect": [400, 580, 200, 50], "text": "продолжать", "action": "scene128"},
      
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  },
  "scene128": {
    "title": "1812 – Франция атакует и Санкт-Петербург горит",
    "text": "1812 – Франция атакует и Санкт-Петербург горит. Во время войны с Наполеоном город легко сгорал из-за своей деревянной архитектуры.\n Многие документы и наследие были утеряны. Хотя он не был захвачен, культурная рана была настолько велика, что город утратил свою центральную роль.",
    "image_path": "Final-Project_1/Images/128.png",
    "buttons": [
      {"rect": [400, 580, 300, 100], "text": "End game", "tooltip_text": "End game", "action": "endgame"},
      
      {"rect": [20, 20, 300, 50], "text": "Back to Menu", "action": "menu"},
      {"rect": [350, 20, 200, 50], "text": "Save Game", "action": "save"}
    ]
  }
}
